[
  {
    "videoLink": "https://www.youtube.com/embed/vlpq241xQTw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "I’ll share with you some of the most famous short quotations from Shakespeare’s plays, with a little bit of background information to the quotation, and something about the character who is speaking. We will cover quotations from Hamlet, A Midsummer Night’s Dream, King Lear, The Merchant of Venice, Much Ado About Nothing, and Richard III. However much, or however little you already know about Shakespeare, I hope I can encourage you to explore further, by reading one or more of his plays, watching one of the many film versions, or even doing some performing!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "6 Famous Quotations from Shakespeare",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/LRW60kpxP8w?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Giving a presentation can be difficult and scary, but you can make it much easier by preparing. In this video, you’ll learn phrases, sentences, and questions you can use during each part of your informative presentation. Learn how to handle difficult questions, how to set the tone for your presentation, and how to keep it moving along. Learn the phrases I teach in this video, and start using them in your own presentations. You might be surprised how easily you go from a nervous, intermediate speaker to an advanced learner who has command of the language and the attention of the audience.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "How to Give an Informative Presentation: What to say and do",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/MfSJ6HbXMlw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Get ready to boost your job interview confidence and get the job you’re after! In this must-watch video, you’ll learn how to answer the 5 hardest interview questions and leave a lasting impression on your potential employer. With my tips and real-life examples, you’ll be equipped to DESTROY any job interview. Job interviews are stressful – you have one chance to stand out and secure your dream job. I can’t help you be better at your job, but if you are good at what you do, these tips may help show your potential employer that they should give you a chance.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "How to Answer the 5 HARDEST Job Interview Questions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ZCUUIuk5Gzc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Improve your communication skills with these 17 common English idioms and phrases for talking about success, chance, risk, and luck. With clear explanations and fun examples, you’ll master these phrases in no time. Face it, tiger. You just hit the jackpot. Watch, learn, and then start using these expressions in your English.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Get Lucky with Benjamin: 17 Everyday English Phrases about Luck & Chance",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/0eoKIA5IFro?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you notice people sometimes use the plural pronouns THEY, THEM, and THEIR when talking about one person? In this lesson I’ll explain why this is done to avoid specifying male or female gender. I’ll give some example sentences to show how it works, and I’ll include a test that we can do together towards the end of the video. And there’s also a quiz for you to test your understanding.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Gender Pronouns: Using ‘THEY’, ‘THEIR’, and ‘THEM’ for a single person in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/uLqdmB0-J9M?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn all the vocabulary you need to talk about having a baby and being pregnant. I will teach you medical vocabulary, slang phrases, and important verbs that all have to do with getting and being pregnant. You’ll learn how to talk about different ways people get pregnant, what happens during pregnancy, and on to the time when the baby finally is born. I got an ultrasound and all I saw inside me was Mr. E.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Learn English Vocabulary: Pregnancy & having a baby 🤰",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/tNCsgQLc8dM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn advanced verbs, nouns, and collocations for speaking about your career in English. In this class, we will go beyond the simple words used to describe your job and learn about your career path, ladder, plan, opportunities, and more. You will also learn how to use precise verbs to discuss these parts of your career: contemplate, decide on, long for, execute, etc. Start climbing the career ladder by building your vocabulary with this lesson.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Professional English Vocabulary: Talk about your career",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/IUnEoJ1NdMw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Knowing exactly what to say will help you get out of problems at work that almost everyone has at one time or another. In this video, I’ll show you how you can respond confidently, yet still professionally, when you encounter certain very common problems at work. We’ll talk about what you can say when your employer is giving you too much work, when a colleague is acting as if they’re your boss, when a long conversation isn’t going anywhere, and more. Next time you have one of these issues at work, try using one of my suggested responses and let me know in the comments how it goes.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "How To Solve 5 Common Workplace Problems",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Ls7-y_r6bHk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "English is a tricky language. It’s so tricky, in fact, that even native speakers often make mistakes with it. Here are 14 very commonly misused expressions that many speakers don’t even realize they are using incorrectly. These include irregardless, ex-patriot, piece of mind, could care less, and more.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "14 Expressions Even Native English Speakers Get Wrong",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/J0NpmKDt1o8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn how to use this single verb in 12 different English expressions and phrasal verbs. These are all short and easy expressions to learn, and they are satisfying to say. Learn these expressions and start using them with friends, colleagues, your grandmother, diplomats, and baristas today.",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "Can you guess the verb? (they’re all F***)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/8kK51sMDPvo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Today we will look at a sonnet by the 19th century poet, Christina Rossetti. It’s called ‘In an Artist’s Studio’, and has a connection with the visual arts and painting. I’ll go through the poem in detail, explaining the meaning and looking at some technical aspects such as rhyme, structure, form, and alliteration. I hope you find it interesting. I’ll also give you some background information on Christina Rossetti, her brother Dante Gabriel Rossetti and his wife Elizabeth Siddal. Go here for more information, and to see some of the paintings.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Let’s Read and Understand a Poem: “In An Artist’s Studio” by Christina Rossetti",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/TLpFIsdwWMc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Invited to a supper/dinner party? Not sure what to say? Not sure what to do? Avoid embarrassment and awkwardness by watching this video before your supper party for the answers to all your questions.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "What to do and say at a supper party",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/sh0D2LKG3vg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The English workplace is generally quite polite. You need to learn how to express your opinions and decisions politely, but also firmly. This is particularly important when there is a conflict. In this lesson, I’ll teach you polite and professional English sentences you can use in the office when conflict arises or when you need to negotiate. You can use many of these expressions in everyday life situations, too.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Business English: Polite Expressions for Resolving Conflict",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/SzXmcTODtLE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Proverbs are short, wise sayings that give advice about life. People use them often in social and business situations. You can upgrade your English by learning to understand and use them yourself. In this video, I teach you six common English proverbs, including: Don’t count your chickens before they’re hatched; Don’t bite off more than you can chew; Don’t judge a book by its cover, and more. Notice they all start with “don’t”? You may have similar sayings in your own language. Watch and let me know in the comments!",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "6 Common English Proverbs – What do they mean?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/klYxnqQiIJI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "No one likes to feel embarrassed or uncomfortable in front of people. There are good reasons for having these strong feelings when we have to talk with people or when we try to use a new language we haven’t mastered yet. But in this video, I’ll show you that some of these feelings might not be serving us so well anymore. I’ll show you how you can use relaxation techniques to reduce the feelings of embarrassment and strengthen your confidence and performance.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "RELAX and stop feeling embarrassed when you speak",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/7cV3HT3urfY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Applying to university or college is a complicated process. Making it even more difficult is the requirement of an essay, statement, or letter. In this video, I share some tips to help you understand the different types of writing you might need to submit and ways to make them more effective.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "5 Tips for University Applications: Essays, Letters, Statements, etc.",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Vf0on6KQP2Y?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "“Sorry” is a useful word, but it’s not the right word for every situation. It loses its power when used too much and in the wrong situations. In this video, I’ll give you more precise and powerful words to use in situations you’ll face in life. We’ll cover words and expressions including “whoops”, “my bad”, “sorry about that”, “pardon me”, and “excuse me”, as well as ones you can use in more serious situations such as “I want to apologize”, “please forgive me”, and more.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Improve your Vocabulary: Stop saying SORRY!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/FNEMPd2nFEU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "If you’re living or planning to live in an English-speaking country, you will need to speak with customer service departments often. Whether you want to get your internet fixed, negotiate a better price for your mobile service, or complain about being overcharged, you will need to talk to customer service – usually on the phone. In this video, I’ll teach you common sentences that you will use and that you will hear in conversations with customer service.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "English for Daily Life: Talking to Customer Service",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/aRXVMJQImSo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Prepositions are function words. As there are many functions, these small words have many uses. They are especially hard to learn when combined with other words. We call these combinations preposition collocations. In this lesson we focus on collocations with prepositions grouped around the words “house”, “time”, and “agree”. You will learn preposition collocations such as in-house, outhouse, by the time, at the time, agree to, agree on, and many more. More importantly, you will start to understand some ways in which you can group preposition collocations when you encounter them.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Learn English Prepositions: Preposition Collocations",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/9Qb81hdFK3E?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "To get a higher score on the IELTS Writing test, it’s important to know what the examiners are looking for and how they score your summary, letter, and essay. In this video, we review the 4 scoring criteria and discuss tips on how to get the best results in each. After watching this video, you will be familiar with the scoring criteria of Task Achievement & Task Response, Cohesion & Coherence, Lexical Resource, and Grammatical Range & Accuracy. You will learn what each of these mean exactly, what examiners care about when they score your work according to the criteria, and where you should focus your study efforts.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "How IELTS Writing is Scored (+ how to get the best results!)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/AeWrsem6NKI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "You might sometimes wonder whether to use ‘will’ or ‘shall’ in English. Do you even need to use ‘shall’ at all these days? In this lesson I’ll explain exactly how and when ‘shall’ is used. I’ll also show you which personal pronouns it belongs with, and I’ll give some example sentences to show how it works in practice. Shall we proceed…?",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "‘Shall’ in English: Everything you need to know",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/4vjryGkgeYE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn 5 easy phrases that you can start using at work to appear more professional. These phrases are especially useful when speaking to your superiors at work. Not only will you come across as more professional by changing your everyday language slightly, you will give the impression of being more assertive and confident, without crossing over into being rude or aggressive. Today’s lesson will cover “on the same page”, “I need your help”, “I believe”, “My perspective is”, “touch base”, and more. Start trying these out at work and let me know if you notice a difference in how colleagues respond to you.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "How to be more professional at work: 5 phrases to use",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/NdLI2Iuj7JY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Does life sometimes feel like a battle? That’s probably why we have so many everyday expressions in English that come from war. Speak richer, more colourful English, by learning some of these expressions today. In this English class, you’ll learn 38 expressions that use the language of battle, guns, strategy, soldiers, and more. We’ll cover expressions such as over the top, axe to grind, rank and file, dodge the bullet, long shot, and many more.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Learn 30+ Everyday English Expressions from War",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/jTabtn7K2i8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know the difference between Elizabethan and Victorian? Have you noticed how many English or British kings were called Edward, or George, or Henry? In this lesson I’ll give a summary of hundreds of years of English and British history. We’ll talk about some of the labels used for the different periods, and some of the kings and queens – including a short period when we didn’t have a monarch at all! If you’ve heard names like Tudor, Edwardian, Restoration, Victorian, and Elizabethan, but not been quite sure exactly what they mean, this lesson is for you. These names are useful to know if you’re studying anything historical, including literature, architecture, works of art, and music.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "The Ages & Periods of English History: Victorian, Tudor, Edwardian, Elizabethan…",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/4mRl6eW3yT0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Join me for a conversation with my great friend, MJ, a yoga teacher from Canada who lives in the UK, in Devon. MJ tells us about her path to becoming a teacher, about the benefits of yoga, mindfulness, healthy eating, and more. Learn more about MJ’s work and courses she offers at her website All To Love and her YouTube channel.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Real English Conversation with a Yoga Teacher from Canada",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/CsFtVU7f_yc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Today we’re going to talk about adjective clauses, specifically adjective clauses with prepositions. This is an advanced English grammar topic, and it’s time for you to learn it! We’re talking about sentences such as “The book, in which she discusses her long career, is a real eye-opener.” This lesson explains the construction and use of this clause type and shows you how to reorder sentences in order to find the right object.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Grammar: Adjective Clauses with Prepositions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Y5M4qy4vgeM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn English for the workplace in this lesson. I will give you many expressions you can use to negotiate politely at work and in business. Whether you are negotiating a formal business deal or just having work-related conversations, this lesson will show you how to make your speech less confrontational and more professional. We’ll cover expressions such as “I would have to check with…”, “That should be doable”, “I could look into it”, and more.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Work English: Expressions for polite negotiations",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/HT-ETQJpblk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In England, we love to complain! We moan and grumble all the time, and we have many expressions we use for all this moaning and grumbling. In this lesson, I will show you informal ways to complain as well as formal expressions for complaining at work. You’ll learn expressions such as a botch job, a bit miffed, all gone a bit pear-shaped, bog-standard, and many more. Complain about this class in the comments.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Improve Your Vocabulary: 24 ways to complain in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/YuVBTgT3YdQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn 14 English expressions that use the language of food and eating to talk about all kinds of different parts of life. I’ll teach how to use expressions such as to have a lot on one’s plate, to bite the bullet, to step up to the plate, crunch time, gut instinct, cash cow, dog eat dog world, and many more. If you’re ready, step up to the plate and start learning. After your meal, you can have a quiz for dessert.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "14 ENGLISH IDIOMS & EXPRESSIONS from food",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/wJ0K45PEiko?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know the difference between historic and historical? What about economic and economical? Join me and learn the correct meaning, pronunciation, and spelling of six pairs of commonly confused advanced adjectives. This advanced English vocabulary will upgrade your English easily and powerfully! To upgrade your English further, take my online course, Correct Your English Errors in 10 Minutes a Day.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Upgrade your English: 12 Confusing Advanced Adjectives",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/3t-O5fnm3QA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn how to ask for and to give a price quotation. This is something all businesses need to do, but also something that’s necessary in regular life. In this class, I’ll teach you common expressions and vocabulary used to discuss quotations over the phone and in emails. The language we use for this area is specific and quite formal, so it may be new to you. Make sure to take the quiz after watching to lock in these English expressions.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Business English: Asking for and providing a quotation – expressions for email & phone",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Ii10L6OYwZM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Take your professional and academic writing to a higher level by learning all about appositives. When using appositives in your writing, you’ll get a higher score on the IELTS or TOEFL. I’ll teach you what appositives are and how they work. I’ll give you lots of examples so you understand when and how to use appositives easily, correctly, and confidently. I also show you what happens when you don’t use appositives, so you see the difference they can make. Watch and start writing in a more advanced way today.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Upgrade your writing with APPOSITIVES",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/exmDE3cMU24?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What is an infinitive clause? What is an infinitive phrase? You might be interested to learn that this sentence includes an infinitive clause (“to learn that…”). It’s a clause that includes an infinitive followed by a noun clause used together as a complement to what preceded it. Well, that sounds complicated, but if you watch the lesson with me, we’ll go through it step-by-step. You’ll learn the construction, usage, and have plenty of examples and practice. Let’s start.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Advanced English Grammar: The Infinitive Clause & The Infinitive Phrase",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/4e9pSFN795U?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Can you understand English jokes? Understanding humour in English is a sign that you’ve reached a new level! In this video, I’ll introduce you to a few examples of verbal humour. I’ll explain how these examples work and what makes them funny. Puns are used in everyday speech and also in newspaper headlines, so this lesson is relevant to spoken and written English. Many puns follow similar patterns, so once you understand how some of them work, you will be able to understand new ones you encounter on your own.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Advanced English Vocabulary: PUNS & DOUBLE MEANINGS",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Xl2mKmm_iNQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn English vocabulary you can use to talk about products, advertising, sales, marketing, consumers, and more, all in this class. An important lesson for anyone who needs to discuss business in English, especially any business that involves sales to customers. I’ll teach you how to use words and terms such as market share, rebranding, saturation, consumer goods, upmarket, disposable income, product range, sales forecast, and many more. After watching, test yourself with the quiz.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Business English Vocabulary: MARKET, PRODUCTS, BRANDING, CONSUMERS, and more",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/DH1ADfs0_xY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What is thy bidding, my master? Shall I compare thee to a summer’s day? You’ve probably noticed these old forms—THY, THEE, THOU, THINE—appearing in English literature, especially poetry. Even modern works that are set in the past or that are trying to be very formal use these words sometimes. But it’s important to understand what they mean exactly and how the words differ from each other. It’s also important to know about the verb endings that go with them, so here is my explanation. After watching the video, do test your knowledge in the quiz—thou knowest it makes sense!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn English: THOU, THEE, THY, THINE",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/03VD4PvnwiA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "An easy way to learn phrasal verbs is to learn them in pairs. When you learn one phrasal verb, learn another that means the opposite at the same time. In this English class, I’ll teach you four pairs of phrasal verb opposites, so eight phrasal verbs in total. I’ll teach you how to use: start out, end up, build up, die down, pass out, come to, talk out of, and talk into. And I’ll give you a few extra meanings for some of these as well. Are you ready? Or are you not even sure how you ended up here?",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "8 Phrasal Verb Opposites in English: pass out, come to, talk into…",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/eQkEBwRa_s8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "At work and in many other areas of life, we often have to respond to feedback that people give us. Sometimes we are responding to compliments (positive), and sometimes to criticism (negative). In this English class, I’ll give you many ways to respond to feedback politely and appropriately in different contexts. You’ll learn to use expressions such as “Thanks so much for your support”, “That’s good to know”, “I’ll certainly pass that on”, and many more. What do you think of this class? Let me know in the comments and I’ll try to respond politely.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Polite English Conversation: How to take feedback",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Pf9Bz4EPLeE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Today we’ll work on our vocabulary by reading an article from an online UK newspaper, The Guardian. This article was written by Julia Kollewe and Rob Davies, and it’s about robots being used to pick raspberries. You will probably encounter some new English vocabulary and expressions. We’ll learn words such as: quivering, shift, tweak, punnet, and expressions such as let loose. I recommend reading this and other articles aloud, to help you with pronunciation and fluent speaking.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn English with an article from The Guardian",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/lo0pPv8L2s0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Looking for a job? Potential employers don’t want to know what you did in the past; they want to know what you accomplished. They want to know what you bring to the table. What contributions can you make, and what results can you bring to their company? In this practical resume writing lesson, you will learn the difference between a TASK-BASED RESUME and an ACHIEVEMENT-BASED RESUME. Stop making this common resume writing mistake today! Study the examples, complete the quiz, and improve your chances of landing a job by making this key change. Good luck!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Don’t make this mistake on your resume!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/3zQVJ-rffAI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The definite article (the) confuses many English learners. It can be difficult to know when the needs to be used with abstract nouns like “love” and “happiness”. In other situations, it might be unclear if the noun is abstract or not. In this advanced English grammar lesson, we will review some of the situations and figure out how to use this important grammatical tool.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "The Definite Article: When to use “the” with abstract nouns in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/eXosYp9hwU8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "After this 20-minute class, you will speak more clearly and intelligently. You’ll learn to use 17 advanced English verbs, including: cement, cut off, damage, develop, disrupt, encourage, establish, foster, improve, jeopardise, maintain, promote, restore, resume, sever, sour, and strengthen. I’ll give you the meaning, examples, and we’ll practice together with a quiz.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Improve your Vocabulary: 17 Advanced Verbs",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/7w2DQ0JaETk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "So you’ve decided to start writing a story, but you don’t know what to do and what to avoid. In this video, I will give you tips and best practices for creative fiction writing. I cover topics such as precision of language, limiting adverbs, eliminating “that” in adjective clauses, using a variety of sentence types, and deferring judgment of your own work. Writing is an art – a craft that can be learned. I hope this video will help you get off on the right foot. If you want to hear more about the writing craft, I recommend checking out On Writing by Stephen King on Audible. To start your free trial and pick up On Writing, or hundreds of other creative writing books, sign up here.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "6 tips for improving your creative writing",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/UKZ5p2lKCkw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Scottish poet Hugh McMillan will read us one of his poems today. We’ll talk about the Scots language as well as aspects of life in Scotland: language, arts, culture, history, geography, politics, and more. You’ll learn about how Scots is a sister language to English, with its own vocabulary, and how even apostrophes can be an issue to be debated. You can find much more about Hugh McMillan and his work at his website. Also visit his YouTube channel, where you can hear many, many other poets reading their work. If you would like to learn more about Scotland, Hugh suggests these sites: Electric Scotland, Hidden Scotland, and the Association for Scottish Literary Studies. Finally, the poem read at the end of the video is by Josephine (Josie) Neill. You can find more of her work here and here (available only in the UK).",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn about Scotland with a Scottish poet",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/TVB9r8PWAw4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "When you’re giving a speech or presentation, it’s important not to sound like a robot or a parrot. You want to sound natural, engaging, and ALIVE! One of the ways in which you can do this is by improvising while you’re speaking. In this video, I’ll show you examples of improvising during a speech and show you how you can start doing it yourself. Improvising does not mean that you won’t prepare. In fact, you need to know your speech so well that you can get away from your plan and easily get back to it. But the result can be much more effective, so it’s worth it. Take the first step now by watching this class, then watch my other videos on speech and presentation skills.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "How to IMPROVISE during your speech or presentation",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ePdkKz-drAU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Today we’ll read an article that uses some advanced English vocabulary and expressions. This article by Jon Excell is about some World War II bombs that are in the water very close to the shore of the UK. Even though the bombs are now very old, they are still a serious threat. This article uses a lot of advanced words and phrases, so it’s perfect if you are trying to take your English to the next level. Read this article with me, and then I suggest you read more articles on your own at the BBC Future website.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Improve your English Vocabulary by reading an article with me",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/5NJ3Si7p3no?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn how to start a natural conversation with someone in a way that forms a bond. I’ll give you five questions you can use to get someone to open up with you. These questions all need a little bit of a lead-up, so I’ll give you THOSE leading questions too! We’ll also look at how a conversation is kind of like an essay. Watch this lesson and learn how you can start having deeper conversations that lead to more rewarding relationships with the people you meet.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "5 questions to get the conversation going!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/RjjgaKfML68?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Practice your English listening skills in this conversation with Rich. Rich moved to Canada from the UK for work, and I speak to him about his interesting life journey and about the differences between life and work in England and in North America. Rich will also talk about his experience of having to take the IELTS! This video is a perfect opportunity to test your ability to listen to two native English speakers having a real conversation.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "English Listening Comprehension: Native Speaker Conversation",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/V95z3k5ShuM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Many expressions in English come from the Bible. A lot of these expressions are used in everyday English, by both religious and secular people. Some are so common, you may be surprised to learn they come from the Bible originally. Today I’m going to teach you 25 of these expressions. Learn expressions such as the writing’s on the wall, wit’s end, rise and shine, fall from grace, and many more. You’ll learn when to use them and hear examples. Gather around the mount and hear the sermon of Benjamin.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Learn 25 English Expressions from the Bible",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/sjrKSTG2RBA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you have to give a speech or presentation? Start here. In this class, we’ll look in detail at a classic speech given by John F. Kennedy. By understanding how exactly this speech works, we can learn how to make our own speeches more powerful and impactful. We will look at word choice, but also talk about timing, tone, and more. Next, watch my lesson on how to improvise during a speech.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "How to Prepare for a Speech",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/7be7NQKbV3M?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In some situations in English, it can be difficult to decide whether to use a plural or singular verb. Even native speakers get confused in these situations. In this grammar lesson, we will learn how to match subjects and verbs. I’ll also talk about some of the nuances here: sometimes it’s better to change the sentence entirely.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "“There is” or “there are”? Matching Verbs in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/9RySKDURqxs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "This is my complete guide to writing emails! Most people nowadays need to write emails almost every day. In this video, I’ll first give you general advice about emails, and then take you through each section of an email and tell you what phrases you can use. What works for your friend is different from what would work for your colleague, but even business emails should be different depending on the person you’re writing to.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Writing Emails: My Complete Guide",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/pO4MqzIKWas?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Can one object in English be plural? Yes! Find out why, when, and how. Do we say “my jeans is tight” or “my jeans are tight”? “Where is my glasses?” or “Where are my glasses?”, “here is the scissors” or “here are the scissors”? Learn about these unusual words and correct these common mistakes made with plural nouns, which refer to one thing, but are actually plural! Master this important subject related to subject-verb agreement in English.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Learn English Grammar: Single Items, but Plural Nouns!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/gdIWwvv2YcQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Need help preparing for the IELTS or TOEFL? I have been helping students get ready for these English exams for many years and have some useful advice for you. Watch this video before you start studying so that you can create the most effective plan for yourself. You will also find out why the writing section is the most difficult and needs the most study time. After watching, go to my other site, WriteToTop.com, for useful materials to help you write better.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS & TOEFL Study Tips: What you need to succeed",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/-r0FstXoNhk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn vocabulary and practice your English listening and comprehension skills at the same time. In this lesson, I’ll teach you words that come from the world of medicine and doctors, but which are used much more generally in the work of business and professional English. These words and expressions are very common to hear in an office. Learn how words like operation, Band-Aid, dose, and checkup are used to talk about business.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Listening, Vocabulary, Comprehension: Medical words used in business English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/82a5fEZKzkU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn about a lifesaving medical charity, Anthony Nolan. The charity works internationally to help people with blood cancer recover by matching them with stem cell donations. See if you, or someone you know, can become a stem cell donor via an international database, and save a life.  You’ll also hear what it’s like to work for a charity. This is also an excellent opportunity for you to listen to an English conversation between two native speakers.\nLearn more about the Anthony Nolan organization and the World Marrow Donor Association.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Help a Charity, Save a Life",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/wm5rHHMwmnc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "We’ll look at some strange and illogical idioms that native English speakers love to use. You’ll learn what they mean and how to use them in everyday speech. There’s a slim chance that you might guess the meanings of some of the idioms in this lesson, but to make sure they are all clear as mud, I’ll explain them anyway. By the end of this video, you’ll be right as rain.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "??? Strange English idioms that don’t make sense",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/kkWF6fP2_vM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this discussion with Michelle, my student from China, we talk about her experience during the 2020 lockdown, and compare behaviour and attitudes about the pandemic in China and in England. I also talk to Michelle about her experience living in London, and she gives her tips on learning English and adjusting to life in an English-speaking country.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Comparing life during lockdown in China & England",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/gPqh9-gEYTY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "How do posh people talk? This lesson is all about posh people in England! How do they talk? What kind of jobs do they have? What kind of lives do they live? I will explain what it means to speak and act like a posh English person in terms of social class and family background. I will also give you some examples of British actors, such as Benedict Cumberbatch and Keira Knightley who, in most of their films, play the parts of posh people. You will also learn about Nancy Mitford’s “U” and “Non-U” language. She was an English journalist and novelist who wrote about posh people in the 1950s. Though society is always changing, awareness of class and the language associated with class is still very important in England, so if you’re studying English or just interested in English culture, watch this video.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How do posh people speak? Learn about language and social class in England",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/mFvqn00AkxA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Improve your English with a sonnet by the American poet Emma Lazarus. This poem was written in 1883, but it has a lot of relevance to what is happening in the world today. You might feel threatened when looking at an old poem – all that formal unfamiliar vocabulary can be intimidating. But I’ll show you that it doesn’t have to be scary. I’ll take you through the poem line by line and explain the difficult words and concepts. We will also learn a little bit about the poem’s structure and rhyme scheme. This is the article I refer to in the video.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn English with a Poem: “The New Colossus” by Emma Lazarus",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/1aVwhhGUMV8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Listening to teachers and professors at school, college, and university is challenging. I recently went back to school to complete my Master’s degree. I had up to 6 hours of lecture every day. In this class, I’ll teach you the listening strategies that I learned about and used that can help you. I will also talk about the best way to take notes and what to include in them. After watching this video, watch my video on the Cornell Notetaking Method.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "How to listen to lectures: Understand & remember with these strategies",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/PVgmUfHGRHM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "These words related to the COVID-19 pandemic are overused. When words are overused, they stop having impact. In addition, these terms are not precise. I’ll give you new, more precise, terms you can use to enrich your English vocabulary and speak more accurately.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Stop using these COVID words!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Rhc8ck46Mq0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Writing an article is an important step to getting recognized in your profession and raising your profile in your chosen field. In this video, I’ll take you through a step-by-step process you can use to write an article – starting with what you should write about, through planning, writing, and editing, all the way to publishing. Follow these steps, take some time to actually write a few articles, and you will soon be on your way to greater professional success.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "How to write an article",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/R5qNf-GKGUk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "G’day mate! Do you want to learn Australian English? In this lesson with the help of my friend Joey the Kangaroo I’m going to teach you Australian vocabulary and slang. I might be a Pom (English person) but fair dinkum I know a thing or two about life down under. I’ll teach you the meaning of common Australian phrases and Aussie lifestyle slang. Apologies in advance for my Australian accent…I’d had a few too many bevvies before I recorded this lesson!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Australian English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/j6l7Du_RXHI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What’s it like to move to the UK and raise a family here? Watch this interview with one of my London-based students, Chong from Malaysia. You will hear about Chong’s experiences of coming to the UK to live, study, and work, his first impressions, the weather, the food, and of course the language!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Life in the UK: What’s it like to move to, live, and work in London?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/qCfHWM_hnXE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are you feeling hungry? I think you will be after watching this video! Today we are out and about in the suburbs of London. Come with me and visit a very special Fish and Chip shop called The Vintage Fish. This kind of food is traditional in England. We’ll be meeting Selim, the owner of the shop, who will tell us all about fish and chips, and will show us how it’s cooked. Be sure to visit The Vintage Fish if you’re going to be in London!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Life in London: Fish & Chips",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/JhMePkgRotA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn about verbal AND non-verbal communication in this lesson! In this video I’ll teach you about expressions we use to talk about physical actions and body language. These are things we do physically with our bodies, non-verbal communication, however we also use these verbally as expressions to talk about how people react to situations. When you’re angry you may clench your jaw. When you see a sad movie you may call it a tear-jerker. Learn how to understand the verbal expressions and non verbal information people are communicating around you. It’ll make you better at understanding expressions and reading body language.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Learn 14 English expressions for body language",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/KMcqjhsVYEI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Is it IN TIME or ON TIME? IN GOOD TIME or JUST IN TIME? In this English lesson, I’ll explain seven different time expressions, and the way they are used, with examples and situations.  I think IT’S ABOUT TIME, don’t you?!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn 7 Time Expressions in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/2NJ6g5MHWO0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Rhyme is a great way to learn to add intonation to your English speech and to sharpen your pronunciation. In this lesson, we look at nursery rhymes, rap, and poetry as tools to improve spoken English. By using the techniques in this video, you will make your speech sound much more natural. You’ll also find it easier to understand real English speech and conversation. Roses are red, violets are blue, this lesson is useful, so you should watch it too.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Speak English more naturally: Using rhyme for word stress and intonation",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/jJSal7um9YM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn new vocabulary and expressions AND practice your comprehension in this English lesson! In this video I teach you about boats and sailing. For many of you, this will be a topic you don’t know much about. Excellent! You can learn something completely new… in English! I’ll tell you about the important parts of a sailboat, then I’ll explain some very common expressions that come from sailing that we use in everyday life. You’ve probably heard some of these before: all in the same boat, to jump ship, all hands on deck, and more. Take the quiz to see how much you understood. Watching this video is a great way to practice for IELTS, TOEFL, and other tests which include English listening.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Practice your English comprehension: Sailing vocabulary & expressions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/kf-9CUI0mm8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "All my best advice on how to succeed at your group job interview. Even though everyone hates them, group job interviews are very  common for graduate recruitment, as well as for airline and call centre jobs. If you are anything like me, you won’t like group job interview situations very much, and therefore, you could find them terrifying… and maybe you don’t show your best side and don’t get the job as a result. Not to worry, though, because I will teach you exactly the phrases you should say in your group job interview so that you get noticed. It’s easy to get lost in the group, but with my tips, you will stand out! Whether you want to be a manager or a team player, memorise my job interview phrases, and you will be on your way to success!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "GROUP JOB INTERVIEW: What to say and do to succeed",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/t-FjzW-A1q0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What are the best things to say when you have to cancel your plans with someone? You may worry that canceling will appear rude or impolite. In this video, I will teach you five steps that will make canceling plans very easy. This is a skill that everyone needs to master, regardless of whether your plans are business-related or social. I will also discuss culturally appropriate reasons for canceling plans and key expressions that will make canceling easier for you.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "How to cancel plans: Use my 5 easy steps",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/vGYaNskmQqA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn how to talk about wine in English. There are many different kinds of red and white wines, and the ones we will touch on in this lesson are: Riesling, Chardonnay, Sauvignon Blanc, Shiraz, Merlot, Malbec, and Cabernet Sauvignon. I will teach you where these wines originally came from and with which foods to enjoy them. Then, we will look at wine-tasting vocabulary like tannins, acidity, body, depth, cork,  and more. Finally, I will teach you a few commonly-used idioms including wine and dine, days of wine and roses, and put a cork in it. This video is jam-packed with useful vocabulary. Why not try the quiz after watching?",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "How to talk about wine in English: Vocabulary & expressions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/2LtpJvfA6xA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "It doesn’t matter if you’ve been speaking English your entire life; you’re bound to make some mistakes. Sure, you learned the proper way to say library when you were a kid, but do you pronounce prescription like “per-scrip-tion” or “pri-scrip-tion”? And what’s the proper way to say hierarchy? Improve your pronunciation or just satisfy your curiosity with this fun English lesson that proves you can always learn something new. And probably still keep making the same mistakes anyway because everyone else is making them too. Words in this lesson include: arctic, cavalry, especially, foliage, hierarchy, interpret, miniature, sherbet, February, and more.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "15 English words that even native speakers don’t pronounce correctly",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/BU4j7JZzo-A?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn about a form of poetry called the sonnet. Though poetry can be a bit complex because of all its rules, those very rules can produce some interesting and beautiful texts. The sonnet started in Italy in the 13th century, so the first sonnets were in Italian. We started seeing English sonnets in England in the 16th century. In this lesson, I will teach you more about the history of the sonnet, and then, I will show you an example written by Shakespeare. This is a chance to add to your vocabulary and to learn something about an aspect of English literature. After watching, you can take a look at some of my other poetry lessons.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "English Poetry: Learn about THE SONNET",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/n6u5McnSdv0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Talking with co-workers can be awkward. This video will give you some foundational language to make small talk and connect more with your colleagues. The questions and phrases taught in this video can also be used in other social occasions, and are transferable to texts or other forms of informal written communication. Some of the language in this English lesson includes: “It’s been a while”, “Long time no see”, “What have you been up to?”, “What’s new on your end?”, “Take it easy”, and “Stay out of trouble”. Make sure to do the quiz after watching. Have a good one!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "How to make small talk at work: What to say",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/kb9-x3tcNQI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Have you ever found yourself in a situation where you didn’t order something at a restaurant because you were unsure how to pronounce the word? Maybe you purposely mumbled something and pointed at the menu? In this lesson, you will improve your pronunciation of foods that are difficult to pronounce. Many of the words that I will teach you come from other languages such as French, Greek, Italian, and Spanish. You will learn how to pronounce words like Worcestershire sauce, tzatziki, taramasalata, tabbouleh, courgette, lychee, quiche, hors d’oeuvre, bruschetta, and many more. You will also learn a little about the International Phonetic Alphabet (IPA). This is a useful lesson for you if you enjoy eating out at restaurants or if you like to try cuisines from around the world. This lesson is also essential viewing for native speakers of English, as the foods in this list are commonly mispronounced! Watch, learn, and avoid embarrassment!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Learn how to say 30+ foods that are hard to pronounce",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/_KLp91NeB8M?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Everything you need to know to write a personal statement. Are you applying to university or college? You will need to submit documents to tell the admissions committee more about yourself. One such document is the “Personal Statement”. Students spend weeks or months working on their statement, but many make a fundamental mistake: they don’t make it personal. In this video, we will go over the six essential steps of constructing a winning personal statement that will help you get into the school of your choice. I will teach you how to plan and structure your personal statement, how to research for it, and how to edit it. Writing your statement will take you at least a week, so don’t start at the last minute!",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "How to write a PERSONAL STATEMENT for university or college",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/elCBA3xoDDI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Looking for a job in North America is not easy, but I have tips to help you. In this lesson, I will talk about job hunting and the steps to follow to do it right. I will teach you about what to include and not include on your resume. For example, it might surprise you to know that it is not usually acceptable to include a photo with your resume in North America. We will also talk about the purpose of a cover letter and how to write a good one. Then, I will give you tips for the interview process. I will show you how to get the most out of your job negotiations, like more money and benefits. So if you are looking for employment or plan to look for a job, this class is for you! Good luck in your search!",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "How to GET A JOB in North America",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ZDqUA8SU1ko?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are you preparing your English CV to find work? People increasingly need to have an English version of their CV, even if they hope to find work in their home country. In this video, I give you language tips and phrases you can include in the English version of your CV or resume. By including some of these words and phrases, you will impress your potential employer with your knowledge of English. You may also find the vocabulary and common phrases for CVs useful for your English covering letter. Good luck in your job hunt!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Get a job: Language & phrases for Your English CV",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Bv5o6rfQNi0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this lesson, I will show you how the language we use is a reflection of our deeper psychology. For example, if you are the kind of person who always apologises for your “terrible English”, this is going to hold you back in life. Another example happens when people constantly talk about what they are going to do but in fact, they never do it. I will teach you to be much more aware of the language you use so that you can speak in a more powerful way than ever before. When you speak powerfully, you get what you want. If you speak in a weak way, you will never be taken seriously.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Change your life by changing how you speak",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/z9cAZmWGu1w?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Get ready for the most important lesson you will ever watch! Did you know that your success in life is directly related to others’ perception of you? This means that what others think of you is extremely important. Acting in a way that makes people enjoy being around you could mean the difference between you doing well in life or failing. In this lesson, I will teach you about social etiquette, which is a set of social behaviours that are considered appropriate and good. “Good manners” include smiling, knowing when to bring a gift, how to be polite via email, when to make eye contact with others, and more. I will also talk about how to behave in difficult times, like when you are arguing with someone, for example. And for each of these social norms, I will show examples from literature that illustrate proper behaviour. You will be inspired by excerpts and expressions from poetry by Rudyard Kipling.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Improve your life & find SUCCESS with social etiquette",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/7al51BtYJio?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn to think, speak, and write more professionally with ten advanced business English expressions. Upgrade your English by understanding the meaning of: a viable option, a stop-gap measure, a foregone conclusion, a moot point, a pressing issue, a fruitful discussion, and more. These high-level expressions are used in everyday conversations, meetings, and conferences. Learn them now, to participate fully in the discussion and advance your career.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Upgrade your English: 10 Advanced Business Expressions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/w6oH1e_Z1PA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Dae ye talk Scots? In Scotland, locals speak English, but they have their own dialect, which means a set of different words that aren’t used in England. At first, the accent might also be difficult to understand. There might be a lot of vocabulary that you have never heard before. In this lesson, I’m going to teach you common Scottish vocabulary and fun phrases in my best Scottish accent! Depending on who you ask, Scots is either a dialect of English, or it’s vocabulary that is considered a local slang. However, if you are visiting Scotland, the difference in language is close enough that native English speakers can understand most of it easily. The Scots language spoken in Scotland varies depending on the region. Therefore, in this lesson, I will include the most well known Scottish vocabulary as well as some examples of Doric phrases (North East Scots). Be sure to make fun of my attempts at the Scottish accent!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Learn about the SCOTTISH accent, dialect, and slang!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/iGFAbvwv8oE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "This lesson is all about English expressions that come from mixed martial arts and combat sports! But don’t assume all of the expressions I will teach you have to do with actual fighting. Rather, we use these expressions in everyday conversation when we talk about competition, challenges, and arguments. For example, when we say throw your hat in the ring, we are not talking about a boxing ring, but someone entering a competition or challenge. When we say take it on the chin, we are not talking about punches. It means to accept defeat without complaining. So as you can see, although some expressions come from the world of combat sports, they are commonly used in non-violent situations. Some other expressions we will look at include: spoiling for a fight, the gloves are off, fight tooth and nail, uphill battle, throw in the towel, win hands down, and more. So before you tap out, click the lesson, and do the quiz to test yourself.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Learn English the MMA way!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/AW3KJB6CuJA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "A surprising thing about British town names is they are often pronounced differently than they are written. For example, the name “Tottenham” is actually pronounced phonetically like “tot-nam”, which is only two syllables compared to the three syllables in its written form. Depending on where you are in Britain, you may even hear different variations in pronunciation. So how can you know how to pronounce town names properly? In this lesson, I will teach you about common suffixes of British town and city names and how to pronounce them correctly every time. I will teach you the etymology of suffixes such as -ham, -bury, -field, -wich, -mouth, -pool, and -ing. We will also talk about what these suffixes mean. For example, did you know that any town name that ends in -pool means “harbour”? Learning these suffixes will improve your pronunciation and knowledge of British town names.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to pronounce British towns & cities: -HAM, -BURY, -WICH, -MOUTH…",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/llqPvcciKEM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "This is an English lesson for those who want to improve their email skills… Hey, how’s it going? Haven’t heard from you in awhile. What have you been up to? I’ve been meaning to write you an email about writing informals for a long time. Finally, the day has arrived! Whether you’re writing to a colleague in the office, or you’re just sending a message to a friend, learn some of the most common greetings, questions, and phrases to use to sound as natural and informal as possible. After watching this video, watch my other lesson on how to write a professional email.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "How to write informal emails in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ctOtJlUMBaw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Have you ever tried to read a pronunciation guide and been confused? Do you just skip those guides because you don’t understand the symbols? Memorising the symbols for each of the sounds in English is very difficult and takes time. In this lesson, however, I will teach you a shortcut to help you remember all the IPA (International Phonetic Alphabet) symbols for the sounds in the English language. Learning these symbols takes time, practice, and patience, but it will greatly improve your overall pronunciation of English. Whether you are a beginner or advanced learner, you will surely find this a useful lesson for your pronunciation skills.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to remember IPA phoneme symbols: my tricks!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/EWudvKwNIHA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "William Shakespeare, the great English poet and playwright, was the inventor of a number of colourful words and insults in his writing. In this lesson, we look at ten short excerpts from his plays to learn some interesting expressions you may want to try using yourself. I will pick the best insults from A Midsummer Night’s Dream, Macbeth, King Lear, The Taming of the Shrew, and more. So the next time you want to get rid of an annoying person, try saying, “I am sick when I do look upon thee!” Results guaranteed.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "The 10 Best INSULTS from SHAKESPEARE",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/CTwnQt-PS7c?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The great English playwright Shakespeare famously wrote, “All the world’s a stage, and all the men and women merely players.” It is true that life is like a theatre play, isn’t it? And in fact, there are plenty of expressions we use that are related to theatre language but mean other things. In this lesson, I will introduce you to a variety of idioms and metaphors from the world of theatre which are used in everyday life. You will learn the meaning of to upstage someone, break a leg, hard act to follow, to make a song and dance, to be in the limelight, and more. These expressions are commonly used by native English speakers. Let’s get the show on the road!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn 13 English IDIOMS from the theatre",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/J4_jT1rZp4Y?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this lesson, I will teach you the kind of posh English that was spoken back in the early 20th century, when the British Empire ruled over nearly a quarter of the world’s land area.  “I say, old chap. Wouldn’t it be spiffing to learn some old-fashioned posh words and expressions?” The vocabulary and expressions in this lesson is not in general use anymore, but you still may hear some of the language if you watch period dramas and historic films set in that period of time. If you happen to like the British “stiff upper lip” stereotype from the glory days of the British Empire, then knowing more about the way the upper class Brits spoke during those times will be of interest to you.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "POSH ENGLISH: Old-fashioned British English Expressions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/LAGLxkrsUxM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "It may be impolite to interrupt in your native culture and language, but it is common for native English speakers to interrupt each other during conversation. There are many reasons why we may interrupt someone. Learning how to do it politely will help you feel more confident in your conversational skills. In this lesson, I will talk about when it’s okay to interrupt someone and how to do it politely. You will learn some common expressions you can use, like “Sorry for interrupting, but...”; “Can I just mention something?”; and “Before you move on, I’d like to say something.” I will also teach you expressions you can use when someone interrupts you, for example, “Let me finish what I was saying”; and “I’m almost finished my point.” Lastly, we will look at non-verbal cues to show you would like a turn to say something.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "Conversation Skills: Interrupting politely in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/aCJVCT4G_Ic?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to learn an easy, smart method to upgrade your English writing? A way to get higher grades and better job prospects, while looking more educated? Watch this important lesson and learn all about the semi-colon. I explain exactly what this punctuation mark is, how to use it, why we use it, when to use it, and when NOT to use it. This one lesson can take your English to a higher level – guaranteed!",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "How to use the SEMI-COLON in English writing",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/dRWia9SGZqY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Calling all IELTS candidates! The True/False/Not given or Yes/No/Not given questions are among the most difficult in the IELTS Reading section. But with practice, you can improve your comprehension of this part of the test and choose the correct answer every time. In this lesson, we will look at some tips on how to approach these particular questions. I will teach you strategies to save time on this part of the test so that you can score higher. We will also talk about improving your paraphrasing skills, which means rewording a sentence. This lesson will furthermore allow you to practice your listening skills, so it will require focus. For more material to help you prepare for the test, go to www.writetotop.com. Good luck!",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS Reading: True/False/Not Given Questions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/wdhps_l-5d8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn how to use the modals might, may, must, and can to talk about possibility and certainty in English. A speculation is when you use the evidence in a situation to make an opinion about it. To form your opinion, you ask yourself, “What has happened or not happened based on what I know or see?” You don’t know for sure that your opinion is true, but you can make an informed guess. For example, imagine your friend told you she would call at 6 p.m., but she did not. What could you speculate or deduce? She MIGHT have forgotten. She COULD have been too busy. Something urgent MAY have come up. In this advanced English grammar lesson, we will discuss all the grammar you need to make a speculation or deduction in English.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "English Grammar: Modal Verbs of Certainty – MIGHT, MAY, MUST, CAN",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/JIOlcqvXFkU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "You can increase your chances of success on the IELTS by preparing and practising in advance. Today, we will look specifically at the IELTS General Writing Task 2, which involves presenting two sides of an argument and giving your opinion. The main goal is to ensure you don’t scatter your arguments and make vague points. In this lesson, I will teach you how to structure your arguments in a clear manner that you can follow on test day. It consists of writing an introduction, making points, expanding, comparing, building, and concluding. I will give you useful phrases to help you easily present your arguments. If you are nervous about the IELTS Writing Task, this lesson will provide the practice you need to succeed. By the end of the lesson, you will feel very confident that you CAN DO THIS!",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "IELTS WRITING TASK 2: How to structure an argument",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/SX2-wAHnr64?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "I will teach you 26 ways to say YES in English! Not all ways of saying yes are equally strong in English. In fact, sometimes, when we say yes, we really mean no! How confusing! Due to the constraints of politeness, we are often forced to agree to something we disagree with. In this lesson, I will teach you all the different ways of saying yes in English. You will learn how to tell the difference between a strong and certain “yes”, a neutral “yes”, and even a reluctant, passive aggressive “yes”. You should always say what you mean and mean what you say, but when that is impossible, try some of these different ways of agreeing even when you disagree!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "So many ways to SAY YES in English!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ARBEs-Qc1RA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this lesson, I’ll give you ten examples of verbs that have two different spellings in the past tense. You may know that there are differences between British and American English. But did you know that some verbs can have different spellings depending on the kind of English you write? For example, you can write spelled for the past tense of spell, but you can also write spelt. Both are correct, but one is used more in British English, and the other is used more in American English. Some of the pronunciations are also different, so I’ll be explaining that, too. By the end of the lesson, you will know which spelling to use when and how to pronounce the verbs. Be sure to complete the quiz after watching. For more help on pronouncing these verbs, watch Adam’s lesson here.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "English Grammar & Spelling: VERBS with 2 PAST TENSES",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/pVEk3VcMzz0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Imagine you have a job interview in the near future. How would you prepare for it? Job interviews can be difficult whether you are an English learner or a fluent speaker. Learning about common interview question types can help you prepare and feel more confident for the big day. In many English-speaking countries, interviews often include situational questions. A situational question gives you an imaginary scenario and asks what you would do if it were real. In this video, I will teach you about situational interview questions and how to answer them. This video also has a listening practice that will help you recognize these questions and prepare for them. After watching this video, watch some of my other job interview and employment skill videos. You can also practice further with the resource page I’ve created, which contains many examples of situational job interview questions.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "How to succeed in your JOB INTERVIEW: Situational Questions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/isOnLdTZ2zc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn expressions you can use to strengthen your academic essays. Whether you’re a high school student, an IELTS or TOEFL candidate, or an English language student, this lesson is guaranteed to boost your writing skills and to provide you with tools that will impress professors and make you fit in with any academic discussion. Learn passive prepositional verbs such as: be aimed at, be associated with, be based on, be regarded as, be defined as, be derived from, be divided into, be prejudiced against, and more. This is an advanced, but practical academic English writing lesson. Watch, learn, and your writing WILL improve. Once you have mastered the content, be sure to test your knowledge by completing the quiz, then USE the knowledge you have acquired in your daily written work.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Improve your Academic Writing: PASSIVE PREPOSITIONAL VERBS (also great for IELTS & TOEFL!)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/A496-2a8IVs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this lesson, we will look at a poem by an American poet, Emily Dickinson. In this poem, she describes the sunrise and sunset with metaphors. A metaphor is a figure of speech in which a word or phrase is used in a non-literal way to describe something else. Metaphors help the reader get a deeper understanding of the situation the author is trying to convey. You will see how Dickinson almost makes you feel and experience the sunrise and sunset with words only. Watch the lesson to learn more about how to analyse a poem and also improve your reading and writing skills.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn about METAPHORS in English with a poem by Emily Dickinson",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Ld0gIbUQquo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know how to pronounce Chiswick, Tottenham, Leicester, and Vauxhall? London has some quite unusual place names. Most London place names are not pronounced how they are written, so you need to learn each name individually. That’s why in this lesson, I will teach you 17 London place names and their pronunciation to help you sound like a native English speaker. This lesson is for you if you plan on travelling to London or simply to expand your general knowledge when reading literature or watching English programs. Even many Americans don’t know how to say these names correctly, so watch this video and get them right!",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "How to pronounce LONDON places correctly: Vauxhall, Marlylebone, Leicester, Chiswick…",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/mUrIYJi_HPc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Cricket is traditionally an English sport, and it is a big part of modern English culture. Many words associated with the sport are used in everyday language. Have you ever heard the words wicket, innings, pitch, score, or stumps? In this lesson, I will tell you about the sport of cricket, the vocabulary connected with it, and some metaphors and idioms which come from it. Whether you are a sports fan or not, this is a chance to expand your vocabulary and learn about English culture.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn about the sport of CRICKET: rules, vocabulary, culture, and more!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/dRftuGE48SQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Hopefully, you will never need to use the vocabulary you will learn in this lesson! However, accidents do happen, so it’s important to know what to expect when you go see a doctor. Whether it’s at a hospital emergency room or a walk-in clinic, the vocabulary you will learn in this lesson will help you get through the process more easily. I will teach you how to describe your symptoms to the nurse so that you can get the help you need. You will also learn medical terms, such as diagnosis, IV, dressing, operating theatre, and more.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Learn REAL ENGLISH: Going to the hospital ?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/lLCHFFja5_o?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you only rely on should and have to when giving advice or making suggestions in English? If you’re ready to add variety to your vocabulary and your English conversations, this is exactly the video for you. Not only do I cover the basics such as should, ought to, had better, and others, but I also teach informal ways to give advice such as “You’re gonna wanna,” “Have you thought about,” “You might wanna consider,” and many more. This is a great lesson for advanced English learners who want to sound fluent and natural when speaking English.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "20 ways to give advice in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/W-dn5OSuRlk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Let’s say you arrange to meet a friend at an art gallery or museum. There will be a lot to comment on while you are there. To help you talk about art in English, I bring you this lesson filled with useful vocabulary and expressions to talk about painting, photography, sculpture, and more. I will give you ideas of what to talk about and how to express those ideas. I will also give you tips on how to understand the artwork itself and how to comment about it to your friend. You will learn the meaning of words like installation, medium, watercolour, seascape, marble, bronze, and more. You will also discover the difference between traditional art and experimental art. There is a lot to learn in this video, so don’t miss it!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "REAL ENGLISH: How to talk about art",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/WhDbykAINm4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "This is a mind-altering lesson that will change the way you look at how adjectives are constructed. Only hard-working English students should dare enter. If you’re ready to play with language and get creative, click the play button and learn some of the most advanced and complex vocabulary there is. This lesson covers more than twenty multi-word adjectives, including fun-loving, good-looking, well-developed, full-time, foul-smelling, blonde-haired, three-legged, two-liter, and plenty more. Enter if you dare, and make sure to test your new knowledge by completing the quiz when you’re done.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Advanced English Vocabulary: Compound Adjectives",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/tEqrcLKqrb8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to be more effective at making others do what you want them to do? This lesson is for you! The way that you speak with others is important, because it can affect their behavior, especially if you are in a position of authority. If you are too direct, others may not be receptive to you, and they may not listen or do what you ask for. But if you use a better way of communicating, you will be able to motivate and encourage others in a positive way. Directness in communication is also cultural, so if you come from a culture that tends to be more direct and aggressive than we are in North America, you may be surprised when your communication is not well-received here. Are you not getting the results you need from your employees or even your children? I will teach you communication methods that will help you influence others in a positive way. Feel free to ask questions in the comments, and then describe your success stories so we can all learn new ways to communicate effectively.",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "How to communicate effectively & GET RESULTS!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/RH-dT6BAGzI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Can you ever start a sentence with “but” or “and”? Are double negatives always wrong? And is it really a rule that you can never split an infinitive? In this class, unlearn what you have learned in your English classes and see that there’s a difference between a rule and a guideline, and that in most of the cases mentioned, you’re free to forget the rule entirely. Study these 5 English grammar myths and be the life of the party at your next gathering of friends by being the person who starts a conversation with “Hey, did you know that you can actually end a sentence with a preposition?” After watching this grammar lesson, don’t forget to check your understanding by completing the quiz.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "5 English grammar myths you need to stop believing RIGHT NOW",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/B_8em7OYj2E?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this lesson I’ll teach you FAST native speaker pronunciation. We’ll look at how when native speakers are relaxed and talking fast, individual sounds in a sentence may change completely. This happens because our tongues naturally want to say everything the laziest way possible! I’ll give you plenty of examples of the sounds in words changing when spoken quickly and I’ll also teach you some IPA (International Phonetic Alphabet). We’ll also practice speaking with the right intonation when asking questions, as this is really important not only to convey the right meaning, but also to get the correct rhythm in your speech. In under 15 minutes, you will be able to start sounding more like a native English speaker. Learn more about speaking naturally in my Clear Accent course.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Sound like a Native Speaker: WHEN & WHAT QUESTIONS",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Rme7BnUhuN8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "This lesson will transform your writing by making it richer and more interesting to read. How can you do that, you ask? By using personification, a style of writing which makes an object come to life as if it were a person. Let me explain. If you haven’t done your homework one night, and it is getting late, you might stare at your school books and feel anger or panic. You could say, “My evil textbooks were staring at me, laughing”. Of course, your books are objects that have no emotions, but as a person, you might attribute feelings to objects, and this is what we call personification. The next time you write a story, why not use this technique once or twice, to make the text more engaging? Watch the lesson to find out how to use this technique, with plenty of examples.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Become a better writer: How to use personification",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/uQTo0GBGXGY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Did you know that it’s possible to turn adjectives into nouns? No, we’re not talking about word families like “heat” and “hot.” We’re talking about discussing social groups like the elderly, the poor, the unemployed, the middle-class, and more. This is a useful lesson for those who are interested in debating or writing about social and political issues in English. Alex will also look at the use of this language in popular culture by discussing famous English books and movies which utilize the form and vocabulary taught in this lesson. Click on this video and become one of the enlightened.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Advanced English Lesson: Using ADJECTIVES as NOUNS",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/oMtAlVnMonI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "When it comes to vocabulary, it’s easy to mix things up. Does disinterested mean the same thing as uninterested? What’s the meaning of enormity? Is enormousness actually a word? Check out this video to learn the meanings and differences between these words and others, including simplistic & simple, hung & hanged, bemused & amused, cliché & clichéd, and more. Think you already know the meanings of these easily confused words? Try your luck with the quiz! I guarantee it is anything but simplistic.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "10 words you’re not using correctly",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/IOYDRfyzCFs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Ask questions quickly like a native speaker by learning natural pronunciation. When native speakers of English speak fast, the clear boundaries between words disappear and this is what gives the impression of talking fast. In reality, native speakers are not talking faster than normal—it’s just that the sounds in their pronunciation flow together in the most smooth and efficient way. For this natural, flowing effect to happen in pronunciation there are three important changes in pronunciation that may occur. The first change is that whole sounds in the sentence may disappear completely (elision). The second change in pronunciation is that for the sounds to flow more smoothly, individual sounds may shift to a different sound (assimilation). And finally, new sounds that are not in the individual words themselves may appear when the sentence is spoken quickly (intrusion). No need to worry if that makes learning natural pronunciation seem very complicated; I break everything down for you in this lesson. All you need to do is follow the lesson and repeat after me. I’ll also teach you some IPA (the International Phonetic Alphabet) so that you can recognise the individual sounds of English more easily. For a lot more information on sounding like a native speaker and improving your accent, take my accent course.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Speak English FAST, like a native speaker: 3 methods",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/6fVRZhHam98?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "If you want to seduce your love interest, you will need more than the overused chat-up lines of today. Who better to turn to than the quintessential master of romance himself, William Shakespeare? In this lesson, I will use romantic lines from some of Shakespeare’s plays to show you how you can woo that special someone. Whether you are writing a letter or card, reciting these lines to your lover atop a balcony, or pasting these same lines to 67 different potential dates for the night in a hookup app, your chances of success will be increased if you use the right words.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Flirt and be romantic like SHAKESPEARE ???",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ilBVx4LmYps?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What’s better than learning new vocabulary from a book? Learning new vocabulary from one of the GREATEST works of fiction of the 20th century! In this dense lesson, I will drop you into the world of J.R.R. Tolkien’s The Lord of the Rings to teach a variety of nature vocabulary. The book’s fictional world of Middle-earth is full of real-life landscape descriptions, so even if you’re not a fan of fantasy genre fiction, there is still a lot for you to learn. Words covered in this lesson include: knoll, mist, fog, valley, slope, turf, hedge, bush, thicket, marsh, bog, fen, mire, brambles, and many more! If you would like to check out the book yourself, you can get the audio version FOR FREE by signing up for a 30-day trial with Audible. You can also get the print or ebook version on Amazon. Remember, not all who wander are lost.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Learn nature vocabulary in English with The Lord of the Rings",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/pf0N2Y4ReR8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "This is a special vocabulary lesson for musicians and for anyone who is interested in music! I’ll introduce you to the technical vocabulary of musical theory and notation. You may already have an understanding of music and how it’s written. But if you don’t, then I hope this will be a useful introduction for you, whether you’re learning English as a foreign language or are a native English speaker. You’ll learn words such as note, flat, sharp, clef, tone, signature, semibreve, timbre, melody, texture, and more. I’ll also talk about some of the words that are different in the UK and the US. Also, whatever style of music you like – classical, jazz, pop, folk, country, heavy metal – this lesson has something in it for you. So let’s rock on!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn the VOCABULARY of MUSIC",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/bOAbiMKbgd0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Get confident in your speaking skills for the IELTS. To sound fluent, you must be prepared. And the recipe for success lies in my Lasagna Method. This lesson will focus specifically on the Speaking Task of the IELTS. I will give you some tips to plan what to say ahead of time, no matter what topic comes up during your test. If you prepare yourself well before test day, you will feel confident and look confident to your interviewer. So watch this video, follow my advice, and get a high score.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS Speaking: Improve your fluency with the LASAGNA METHOD",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/VaBCiio8XZs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Level up your academic writing skills by learning fifteen cause and effect verbs that will make you sound like a fourth-year university essay writing pro. If you’re taking the IELTS or TOEFL, these verbs are essential in the writing sections of those exams. The verbs and phrases include: cause, produce, lead to, result in, create, bring about, give rise to, be responsible for, result from, stem from, be caused by, be produced by, be brought about by, and be triggered by. Improvement stems from regular practice and consistently challenging yourself with new material, so make sure you don’t miss out on this chance to improve your written English.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Academic Vocabulary for Essays & IELTS Writing: 15 cause and effect POWER VERBS",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/CCeeBP-ePLs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Whether you watch British TV or are travelling throughout England, you have likely heard the Cockney accent, which is one of the many English dialects found throughout the country. This accent may be difficult to understand at first. To help you, I’ve prepared a lesson on the main features of the London-based Cockney accent as well as some of its non-standard grammatical aspects. We will look at pronunciation features along with vocabulary and slang found particularly in Cockney English. I’ll also tell you a little bit about the history and social context of Cockney English. After watching the video, you will have the tools you need to better recognize and understand this dialect.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn about the COCKNEY ENGLISH accent & dialect",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/vU3PEAc02y4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn the English vowels: I will teach you four phonemes from the International Phonetic Alphabet (IPA). You will learn /e/ as in pet, schwa /ə/ as in to (unstressed), /ɜː/ as in bird, and /ɔː/ as in court. This lesson is for beginners who are unfamiliar with IPA (the individual sounds of English). Learn the IPA vowel symbols to greatly improve your pronunciation. This lesson is also for more advanced students who are already familiar with the sounds of English and their IPA phonetic symbols, and who wish to refresh their knowledge as a result of doing some practical pronunciation practice. Do these exercises for some time and you WILL hear a difference. Join my Clear Accent course to improve your accent step-by-step.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Improve your accent: Introduction to the IPA and vowel sound training",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/CVVlM9KaGyY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Fighting language: I will teach you slang and British English phrases that people use when arguing or fighting with each other. Most of the examples in this lesson are the kind of English spoken by working class people that you may hear, for example, on a television talk show. You may also hear some of these phrases in films that feature Cockney gangster characters. Many of these expressions might not make sense to you if you don’t already know the meaning, so it’s useful to learn the expressions and their meaning. This video will even be useful to North American English speakers who want to understand British shows and writing better. Now go watch the video…you’re doing my head in!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "10 things people in England say when they argue",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/GHjGEYdDcAw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Telling a good story is an art form. Almost any story can be interesting if you take it beyond its basic elements: time, place, and characters involved. Learning how to tell a good story will not only help you in social conversations but also in a job interview setting or even an IELTS Speaking task. Good conversation skills show off your level of fluency and will impress your interviewer. In social settings, people are attracted to and enjoy being around interesting, dynamic speakers. To help you develop your storytelling skills, I have laid out my method based on years of experience as an actor and storyteller. So watch the video to learn how to tell a story like a n engaging, fluent English speaker.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Learn how to tell an interesting story… or make a boring story interesting!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ruLxkg2Jgys?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Toxic language is a way of communicating that harms other people. The lesson is based on the work of Marshall Rosenberg, who educated people to express their needs in a compassionate way in order to avoid violent communication. I will teach you common examples of violent communication, such as threatening, blaming, labelling, diagnosing, and guilt tripping. Many of us often do some or all of these to others without realising. By learning to avoid violent communication, we are able to express our personal needs more effectively and our relationships with others can improve.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Toxic Language & Violent Communication",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Y8pIidfrSG4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Parallelism or parallel structure is one of the secrets of great writing. It gives greater balance and power to the way you communicate. It will help you get higher grades, improve your job prospects, and look more professional. In this lesson, I explain all about parallelism—what it is and how to use it correctly. This easy but important lesson will take your English to a higher level. Follow up by watching my lesson on the Magic of 3 to strengthen your English even more!",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Parallelism: The secret to great writing",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Iav1b6LkD7Q?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What is a compound subject? It is when you combine several subjects together into one. This helps to avoid repetition in a sentence. But how do you make the verb agree with several subjects? For example, do we say “Bill and Kate is kind” or “are kind”? Do we say “Neither John nor his friends need help” or “needs help”? It all depends on subject-verb agreement, which is an important element of writing and speaking in English. In this lesson, we will look at compound subjects and how verbs react to these. I will teach you how to make the verb agree with the subjects in different kinds of sentences. After the video, be sure to do the quiz to test yourself on the material.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Grammar: Compound Subjects & Verb Agreement",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/CK4OrYTsf-Q?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Today we are out and about in the suburbs of London. Come with me and visit a very special shop, an art gallery full of paintings, sculptures, and other art works. But it’s an art gallery with a difference, as money made from sales goes to an organisation called Street Souls, a charity for homeless people. We’ll be chatting to David, who runs the gallery and chooses the art works to display there. We’ll hear about the special opening of the gallery, attended by a famous London-based film star (I’ll give you a clue—he has appeared in Lord of the Rings!). This is a chance for you to listen to real conversation between two native English speakers, as well as to learn about English culture. So, if you’re ready, let’s go in…",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Life in London: Visiting an art gallery",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/zpreak2vCes?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Top o’ the morning to ya! In this lesson, I’m going to teach you common Irish vocabulary and expressions. This includes words for the family, insults, drinking expressions, and more. The Irish words in this lesson are part of the Irish English dialect. Many of them are not part of standard English. I am NOT Irish. I am English. This video is for people learning English, to give them an introduction to the Irish English accent and dialect. Please forgive me for my attempt at the Irish accent!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Learn IRISH slang, vocabulary, and expressions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/6aO6cGTcnUg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Think about your last job interview. What did you do to prepare for it, and how did it go? Job interviews are difficult whether you are an English learner or a native speaker. If you want to get the job, you need to prepare for the job interview. In many English-speaking countries, interviews often include behavioral questions. In this lesson, I will teach you about behavioral interview questions and how to answer them. This video also has a listening practice portion to train you to recognize these questions, as well as tips on how to prepare for them. Try our quiz at the end to practice what you have learned, nail that interview, and get that job! Then work like a dog for the rest of your life ?",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "How to succeed in your JOB INTERVIEW: Behavioral Questions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/8cTkYJX_8Ls?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The verb get is used all the time in English, and in many different ways. In this vocabulary lesson I will give you some slightly advanced examples of how it is used. We’ll go over eleven different uses. So, why not get a move on, get yourself together, and watch the video! Be sure to also watch my other video on ways to use “get” to take your learning even further!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "11 uses of the verb ‘GET’ in English: get going, get together, getting on…",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/UYIiHqZu7kU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What’s the difference between “I’ve been to London” and “I’ve gone to London”? Is there a difference at all? Watch this video to find out when to use been and when to use gone in present perfect sentences. English grammar can seem confusing, but here at EngVid we make things easier by breaking it down and explaining the logic behind it all. Once you understand the rules, you’ll know how to use the language. After you watch the lesson, make sure you understand it by taking the quiz. See if you can score 10/10 this time! Good luck!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "English Grammar: “BEEN TO” or “GONE TO”?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/XLYG0K-pXWo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Did you ever wonder how the months of the year got their names? Maybe you know it has something to do with gods and mythology or Roman emperors, but don’t know the details. Some things don’t even seem to make sense. For instance, an octagon has eight sides, but October is not the eighth month, it’s the tenth! What’s going on? Watch this video, and you won’t have to wonder anymore! You’ll understand why January, February, March, April, May, June, July, August, September, October, November, and December all have the names that they do! After watching this video, watch my other video about the names of the days of the week.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "How did the months get their names?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/r6o6NOjGv7I?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The key to improving your English pronunciation is vowel pronunciation. In this pronunciation lesson, you’ll learn the vowels of English through the IPA — the International Phonetic Alphabet. I will teach you four of the vowel sounds in English: /ɪ/ as in ship, /I:/ as in sheep, /ʊ/ as in cook, and /u:/ as in blue. We will compare and contrast these vowel phonemes in different practical exercises so that you can hear and remember them. This lesson is both for beginners who are completely new to the International Phonetic Alphabet (IPA) as well as for advanced learners who could benefit from some revision of the English vowel sounds to improve their clarity and accent.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Accent training exercises: Learn vowel sounds with the IPA (International Phonetic Alphabet)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/pJ-Vyqxn1To?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Be prepared for any essay on the IELTS exam by knowing what to expect. Whether it’s an opinion essay, a comparative, or a descriptive essay, your approach will need to match the task. In this lesson we look at what kinds of questions may come up and how to approach these. I’ll break it down in detail, clearly, so you know exactly what you should do with each type of essay question. Follow my suggestions and you will succeed. Watch my detailed IELTS full essay video next, and subscribe to my writing channel on YouTube, Write to Top.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS Writing: The 3 Essay Types",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/gp2VvmUJJc8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn the secret exercises actors use to speak with a clear and crisp voice. Improving your pronunciation and spoken English isn’t just about learning theory. You can make yourself more understood by simply training your mouth muscles so that you can produce the sounds of English properly. After all, if you’ve been speaking another language your whole life, your mouth and tongue are probably trained in a different way, to make the sounds of that language, not English. In this video, I’ll go through many exercises you can do to get your mouth used to making the sounds of English clearly. This will improve your accent, clarity, and make you a better English speaker.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Mouth exercises for CLEAR SPEECH",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Qc_uzraKOIU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Congratulations! You have discovered the advanced homophones level! By now, you should be pretty comfortable with the material covered in the beginner and intermediate homophone videos, and you’re probably looking for an extra challenge. Well, don’t worry. I’ve got you covered. In this video, I look at numerous words that are pronounced the same but which are spelled differently. Here’s a small sample: bald and bawled, air and heir, horse and hoarse, and retch and wretch. Are any of these words new to you? Good! Check out the video to learn their meanings, and learn to tell the difference between them. If you haven’t watched my beginner and intermediate homophone videos, make sure to watch them now! And as always, check out the quiz when you’re done to test your understanding of the material.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Advanced English Homophones – different words that sound the same!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/PcIX-U5w5Ws?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this lesson, you will learn about Received Pronunciation, or “RP” for short. It’s also known as BBC English, Oxford English, and The Queen's English. I’ll teach you what this accent means and signifies in England today. You may be surprised to learn that it’s not entirely positive. Some people even try to hide their RP accent. I will also give you the history of RP. You’ll learn where it comes from and how it developed. You will be able to hear for yourself what this accent sounds like, and how it has changed over time.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "The RP English Accent – What is it, how does it sound, and who uses it?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/p45raL43p3Y?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Speed up your English ×5 by learning relaxed pronunciation. In this lesson I will teach you how to say questions with do and did in a natural, flowing way. The secret to speaking fast is that there are no clear word boundaries. Whole syllables may be missed completely (elision), individual sounds may change (assimilation), or completely new sounds may appear (intrusion). No matter whether you are a beginner learner or an advanced speaker of English, I’ll break down the pronunciation for you in the clearest possible way. I’ll also teach you a little IPA (the International Phonetic Alphabet) so that you can be sure that you are saying each question phrase perfectly as well as fast. Learn to say all the question phrase in this lesson and you will speak fast like a native speaker of English. If you want to improve your accent and speaking ability in English further, take my accent course!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Speed up your English ×5",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/jSDoxNzFMZw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Interested in the UK and the British Royal Family? Don’t know who all these dukes and duchesses are? In this lesson, I’ll explain how the British monarchy works. You’ll learn about the members and titles of the royal family, the history of monarchy in the UK, and how our constitutional monarchy works. I’ll answer questions like: What is the queen’s job? Why is there no king right now, even though Queen Elizabeth II has a husband? Who will inherit the throne?… and more. Watch this lesson to understand the royal family and the culture of monarchy in the UK.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "The British Royal Family: Everything you need to know",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/vbWOh5xjgg8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What is passive-aggressive language? In this lesson I talk you through examples of passive-aggressive communication, which happens when a person is angry but their anger is not directly expressed. You’ve probably experienced a situation in which someone tells you that everything is fine, even though that person is actually angry: this is an example of passive aggression. I’m not recommending that you communicate passive-aggressively! This lesson is designed for you to learn the different forms of passive-aggressive communication and typical phrases people use, so that you can improve your own communication and express your needs more directly. It will also help you to recognize when someone’s confusing behaviour towards you is being driven by passive aggression.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Passive-Aggressive Language",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Fmcv0BCKhfQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Ever wondered about the English in Game of Thrones? In this video, I’ll explain the accents of Jon Snow and Ygritte. You’ll learn WHY they sound tougher and stronger than other characters! Want to try speaking in a northern accent, like the Wildlings and the Starks do? You know nothin'! I’ll show you how it’s done! You’ll hear and be able to practice how the tougher characters from Game of Thrones and other fantasy shows and movies speak. This lesson is important for anyone living in or visiting the Seven Kingdoms, and crucial if you’re planning to go north of the Wall. Don’t wait! Winter is coming.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn to speak like Jon Snow & Ygritte from GAME OF THRONES!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/yQStFX6SUXs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Have you ever wondered why we have so many words for the same thing in English? That’s because we used to speak Anglo-Saxon until the French king William the Conqueror invaded us and brought the French language with him. French never became the language of the peasants and ordinary people; it was only spoken in the court of the king and among the powerful. For this reason, French words in English are more formal than their Anglo-Saxon synonyms. In this lesson, we will look at some English history, and I will give you examples of formal and informal words and where they came from. I am fascinated by the evolution of the English language—how it has developed, changed, and adapted over time. Perhaps English is the world’s number one language for international communication because it always adapts, incorporating new words from different cultures and bringing these into the English language itself.\n\nStriking the right register—knowing the right word to use in the right situation—is incredibly important in English. English learners often use vocabulary that is more formal than a native speaker would use, so watch the lesson to learn how to correct this, so you can sound more natural when speaking English.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Formal & Informal Vocabulary: Using French words in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/eWvkSp16VFY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Using participles correctly will dramatically improve the quality of your English writing. If you’re learning English for university, IELTS, TOEFL, or for your career, this advanced writing lesson is for you! You will learn to analyze sentences so that you can understand them fully and write your own. Often, English learners are unsure of whether an -ing word is an adjective or an adverb. In this lesson, you’ll learn how the participle “having” includes the subject, verb, and conjunction. I’ll show you many example sentences, and you can practice what you’ve learned on our quiz.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Advanced English Grammar: Participles",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ewz30PKCnzI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "If I ask you out to dinner and you don’t want to go, how will you say no? We have lots of expressions to politely say no, without actually saying the word “no”. In this lesson, you’ll learn 10 expressions you can use to politely decline an invitation. You’ll discover that that we never directly say that we don’t want to go. This can be confusing for anyone who isn’t familiar with English culture, and especially if English isn’t your first language. Learn these 10 common expressions so you can understand native English speakers, and politely refuse an offer if someone asks you out.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "10 ways to say ‘NO’ in English (politely!)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/bBjp3EVMr64?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "I’ve trained thousands of students for success on their IELTS exam by using these 14 tips! Now it’s your turn. You’ll learn what you MUST do to get the highest score on your IELTS General Writing Task 1. Find out how to easily identify the type and purpose of each letter, and how to start and end your letter perfectly. Learn to save time and effort by using standard expressions. Understand the scoring criteria, so you know exactly what to do and what NOT to do. Visit GoodLuckIELTS.com for a free guide to the IELTS, and download my free resource with sample letters, sample topics, key expressions, tips, and much more. Good luck!",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "IELTS General: Writing Task 1  – 14 Top Tips!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/fkooLJ9MWVE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you get confused when you see long sentences with lots of commas and sections? You need to learn about clauses! Once you understand and can recognize the different types of clauses in an English sentence, everything will make sense. What is the difference between noun clauses, adjective clauses, and adverb clauses? Adverb clauses show relationships, like reason, contrast, condition, time, purpose, and comparison. In this lesson, we will look at these relationship types that make adverb clauses so important in English. I will also teach you when to use commas with adverb clauses. This will help you understand very long sentences made up of several clauses. Remember that as long as you can break down all the components of a sentence and understand the relationships between them, you can understand any sentence in English!",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Learn English Grammar: The Adverb Clause",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/k1rwf370z5E?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you have a hard time remembering what you read? Do you need to read things many times before you understand? Reading books can be discouraging because of the large amount of information on each page. To help you make sense of all that information, I will show you how to create a mind map. A mind map is a graphic that shows categories containing quick reference points from your book. By taking short notes and organizing them in a specific way, you will have all the information you need to quickly and easily remember the important points of a book. Just the process of thinking about and creating this mind map will help your brain to understand and remember the material. Try it! It really works and it is free. Mind maps are especially useful when it’s time to write an assignment or study for an exam! Watch the video to learn how to create your own mind map.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "How to use Mind Maps to understand and remember what you read!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/4aEsu3EU88k?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Have you ever wondered how the days of the week got their names? In this video, I will explain their origins. You’ll learn how these names are related to ancient mythology and to the planets.  Etymology is the study of the origin of words. Some of the days of the week have a simple etymology, like “Sunday”—the day of the Sun, but many of the others aren’t as easy! This is a very interesting way to learn about the English language and the cultures that have influenced modern English. I’ll also explain how these names relate to the French and German languages. Join me as we will travel back in history, and out into the solar system. I hope you enjoy the journey!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Where do the names of the days of the week come from?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/PbCiNdAAUM4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn about the London street accent! English slang is often very different from grammatically correct English. The London street accent is no exception. This variety of English is called Multicultural London English by academics and “Jafaican” by people who dislike the accent. In this video, I explain some of the grammatical features of this way of speaking English and share with you some phrases and expressions. You may not wish to speak this way yourself because it is grammatically incorrect. However, if you visit London, you may encounter people who speak this way or overhear their conversations. It is interesting to compare textbook standard English to the English actually spoken in the real world by Londoners themselves, so watch this lesson to learn all about it!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "English Slang: How to talk like a real Londoner",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/utyWFYJXESo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Stop fighting and start talking! We all get into arguments; usually, it’s with the people we care about the most. In this lesson, you will learn how to relax someone who’s angry, and how to express your feelings in a productive way. That’s right. You can end most fights by following the simple advice that I will share with you here. This is an English lesson, but you’re also going to improve your relationship and social skills. I’ll teach you vocabulary and expressions in English that you can use to start having meaningful conversations. Furthermore, you’ll learn a little psychology, to make you a better communicator.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "How to change a fight into a discussion",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/GpV39YEmh5k?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The lesson that you are about to watch is about adjective clauses, of which there are two in this sentence. Can you see them? In some grammar books, you may see the adjective clause called the relative clause. Don’t get confused — they are the same thing. In this lesson, you will learn the difference between the two types of adjective clauses — the defining adjective clause, and the modifying adjective clause. I’ll also answer a common question people have about clauses: “Should I use a comma or not?”. After this lesson, you will be able to spot adjective clauses of all forms and use them to take your English writing and speaking to the next level.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Learn English Grammar: The Adjective Clause (Relative Clause)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/CDR1zwy9h2Q?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "You may have been following the political debates in the news these days, and maybe some of it didn’t make much sense to you. Politics is often a difficult topic to talk about because people have very different ideas of what is good and bad, and many terms are misunderstood or misused. In this lesson, I will make sense of political vocabulary, so that you can start understanding the news, and have conversations that make sense. Beware: not everyone will agree with you, so keep an open mind and discuss your ideas politely. Politics can be fun and interesting if you keep this in mind!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Talking About Politics: LEFT WING & RIGHT WING",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/_3kU5TZlBRE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Did you know that many words in English originally come from the Greek language? In fact, if you can identify the Greek keywords within an English word, you can often understand its meaning even if it is a word you have never encountered before! In this lesson, I will show you how to break down the meaning of a Greek word in English by learning keyword prefixes and suffixes.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to understand new English vocabulary by learning roots!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/FBAJMZDLW64?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know the difference between one and won? Whole and hole? Threw and through? These word pairs are pronounced exactly the same, but have different spellings and meanings. These sets of words are called homonyms, and I’m going to teach you 10 pairs of these words so that you can learn to spell them correctly. It’s also a great chance to learn new vocabulary through these example sentences. So, what is a homonym? Check out this lesson to find out. Take the quiz to make sure you know the correct spelling of these common words.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Fix your spelling mistakes: 10 confusing words that sound the same",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/xcjgrgkGhB4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "When we speak English, putting stress on one word or another can completely change the meaning of a sentence. In this video, I’ll teach you about sentence stress and demonstrate with lots of examples. You’ll practice listening to two stories and learn how different stress and intonation can change the meaning of a sentence or add hidden meanings to it. This is an important part of speaking English clearly and correctly, and will help you with your English comprehension. In English, there is a saying: “It’s not what you say, it’s how you say it.” By the end of this lesson you’ll know just how true this is!",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Speak like a NATIVE SPEAKER by using sentence stress in English (with examples!)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/9SrEEPt4MQA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Having trouble finding the subject or object in a sentence? It might be a noun clause. In this lesson, we’ll look at the dependent clause and its conjunctions in order to write better sentences and to read high-level texts like those you will find in newspapers, academic essays, and literature. This is also important if you’re in university or taking a test like IELTS or TOEFL. As a writer, I focus my attention on the many elements we use to build great sentences and paragraphs. I’ve broken down this advanced part of English grammar and will teach it to you simply—so you can understand and use the noun clauses in your own writing. I’ll show you many examples of noun clauses, so you can see the noun clause in context. Take the quiz to practice identifying the types of noun clauses in example sentences.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Advanced English Grammar: Noun Clauses",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/zJ_UCfr0xsg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Did you know that William Shakespeare added more than 2000 words to the English language? That’s right! In this lesson, we’ll look at 10 adjectives that were invented by Shakespeare. You’ll learn the meaning of each of the words and how to pronounce them correctly. Often, Shakespeare invented these words by turning nouns into adjectives. Many of the words may have been used in English already, but Shakespeare was the first to put them down, and that’s how they grew to become parts of the language that are still with us today. Native English speakers use this vocabulary in everyday speech and in writing. This lesson has excellent advanced vocabulary that you’ll learn easily because you’ll get the definitions and examples, and I’ll tell you the most common contexts you’ll hear these words in. To continue learning with Shakespeare, sign up for a free trial with Audible and you’ll be able to download a FREE audiobook of one of Shakespeare’s plays.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "English Vocabulary: 10 adjectives invented by Shakespeare",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/QFoWVbgT1Tg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are you writing essays and getting the same score over and over again? Would you like to learn some techniques you can use to improve your writing and get a better score on the IELTS or TOEFL? Well, in this lesson, I will teach you five common errors that many students make that can lower their score. After watching this lesson, you will know what to avoid, what to include, and why trying too hard might actually be hurting your score.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS & TOEFL Writing: 5 Common Mistakes",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/A8Cgi1ss8AM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this lesson, I will teach you verbs, expressions, and idioms you can use to bring out your unique personality and communication style. For example, there is a lot more you can say other than “I think that…” Using other expressions such as “it looks as if”, “it sounds like”, “I sense that”, or “I feel that” makes your language richer and helps you build relationships with others. Watch this video to discover more about your own personal style and how you can express yourself more like a native speaker. This video goes into the theory of NLP (neuro-linguistic programming). If you want to go even further with the idea of representational systems within NLP, you can then use your knowledge of language and behaviour to build stronger relationships and to influence people. For example, if you observe that your friend is a strongly visual person, you can adapt your language and the expressions you use to be more visual. This will help the two of you connect and interact better.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Effective expressions to express your personality",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/nDdRHWHzwR4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Did you know that there are over 30 different English accents in England alone? And that’s not all. Would you believe there are over a hundred different English dialects accross the world? In this lesson, I will tell you about some common British accents you might hear. You’ll hear examples of Cockney, RP, Estuary, Northern, Scottish, Welsh, and many more accents. Don’t miss this opportunity to add some spice to your English pronunciation and comprehension!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Learn British accents and dialects – Cockney, RP, Northern, and more!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/0nDFTCJ7jXA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this lesson, I explain how and when we use to before a verb with the -ing ending. The use of to before an -ing verb is not always correct. But it is correct in a particular case to express an emotion or action happening in the present referring to a past or future event. If this sounds complicated, have no fear! It is a simple structure once you understand how it works. And if you do our quiz at the end, you will get used to using this concept in no time!",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "English Grammar: How to use “to” before an “-ing” verb",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/2XjKKiU4LNo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn the simple, secret word that makes people say yes to you more often! Find out the best ways to make polite requests of bosses, co-workers, friends, family, or strangers. First, we will look at the 3 levels of requests and what they are based on. Then you will practice how to adjust your language to different situations, problems, and people. This lesson will help you achieve more success in business and life! To learn more about requests, read the resource.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "How to get people to say YES!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/hk1AvFgOsSo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "How many verb tenses can you count in the following sentences? “If you practice every day, you will improve. But you also need to know that if you didn’t develop good study habits in the past, you might have trouble in the future.” There are several verb tenses in this excerpt, and they are all mixed together. But complex sentences like these are what make English a very rich and interesting language. In this challenging lesson, we will look at conditional sentences that mix tenses and even use the verb will in the if clause. Make sure to do the quiz at the end to practice and perfect your understanding of mixed tenses.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Mixed Verb Tenses in English: Conditionals and IF clauses",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/aEH2GkuRIHs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Did you know that the English word “human” has a Latin origin? And did you know that the word “people” actually comes from French? Today, hundreds of millions of people speak English either as their first or second language. But hundreds of years ago, the English language that we know today did not exist. It has been evolving through the centuries and continues to do so now. In this lesson, I will teach you the history of invasions, migrations, and other influences that have helped to shape English as we know it. You will also discover English words that have origins in Latin, French, and other languages. Don’t miss this fascinating lesson!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Discover the History of English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/FDpZmmqRTfo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The conclusion of an essay is where you must make your final argument clear. Many students struggle to write their conclusion because they don’t know what to say other than just repeating their previous arguments. If you are taking the IELTS, TOEFL, or CAE English language tests, you need to learn how to write a good conclusion to get a high score.\n\nThe process of writing a conclusion for an essay is a lot simpler if you follow a structure in your writing. Following a structure of what to write means that you can write your essay answers as quickly as possible, without running out of time to answer the question. Remember, the IELTS and CAE exams are to test your knowledge of English — not the quality or originality of your ideas. For this reason, it’s best just to follow an easy structure that you can use any time, which you can replicate without making grammatical mistakes.\n\nIn this lesson, I explain different conclusion structures you can use in your IELTS writing exam. Practise the structure you like best, and memorise a few phrases. After watching, you will be ready to write a good essay conclusion in your exam. Good luck!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to write a perfect IELTS essay conclusion",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/XGZxj8JE6N4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do and did are some of the most common words in English, but do you know how to use them to add contrast or emphasis? In this lesson we’ll look at do and did in affirmative sentences. You’ll learn to use them to make your English sound clearer, more interesting, and more fluent. Usually, you learn that do and did are  only used in questions, negatives, and short answers, but we also use them to make strong points. You’ll hear many examples of how this is done in spoken English. So if you do want to improve your English, watch this video.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Grammar: Using DO and DID to make a strong point in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/MSvVLfWjdFE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Today, you’ll learn two sets of confusing vocabulary! Do you RAISE your hand, or RISE it? Do you LAY down, or LIE down? “Who is LAYING in my bed?” Or is that “Who is LYING in my bed?” This lesson will teach you the meaning of each of these words, and how each of them is used differently. Many native English speakers make mistakes with lay and lie, but by the end of this lesson you will understand the grammatical reason why we use each of them in different situations. This is a part of the language that can be challenging for English learners because it has irregular verbs. But don’t be scared! Mr. E and I will explain it and make it clear. So have a seat and let’s learn some English!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Confusing English: LIE or LAY? RAISE, RISE, or ARISE?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/urr55rAreWc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Did you know there are only four sentence types in English? To improve your writing and reading skills in English, I’ll teach you all about simple, compound, complex, and compound-complex sentences in this grammar video. You’ll learn how to identify the independent and dependent clauses. Don’t worry, it’s easier than it sounds! By learning to identify and use these sentence structures, you’ll make your writing more interesting and dynamic. I’ll also share many example sentences in the lesson, so you can practice with my help.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "The 4 English Sentence Types – simple, compound, complex, compound-complex",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/tEGWeQ1FK8E?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know what a metaphor is? I’d like to show you how English speakers commonly use metaphors in everyday conversations. Metaphors make our language more interesting and beautiful. I’ll give you many examples of metaphors and show you how they are used. I’ll teach you some easy metaphors like busy bee and melting pot, and even show you an extended metaphor written by Shakespeare. If you’re learning about metaphors in school, it’s also important to understand the difference between metaphors and similes and to know their definitions. Practice these expressions and use them when you’re speaking to your friends and classmates. After the lesson, test your understanding of metaphors by taking the quiz.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Using metaphors to speak English more fluently",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ayjKTL5hNGc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Have you ever broken the law? Today, I’m going to teach you courtroom vocabulary. It’s important to know the law so that you know your rights and know how to stay out of trouble. If you do end up in court, you need to know what to expect and how to communicate politely and intelligently so that you get the best outcome. The vocabulary and expressions you’ll learn will help you understand what is happening in courtrooms on television shows and movies, as well as if you have to appear in court yourself. Court isn’t just for hardened criminals — sometimes we have to go to court for misdemeanours — small crimes like parking violations and littering, or you may have to go to court because of a lawsuit or as part of your job. In this video, I’ll discuss different strategies that will help you speak with the people you’ll meet in court — lawyers, judges, and police officers. My best advice is to stay out of trouble, know how to talk to the police, and be informed if you have to go to court.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Real English: What you need to know if you’re going to court",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ANI6IqqvSb8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Did you know that some English words change their meaning if you change the syllable stress? For example, there is a huge difference between CON-tent and con-TENT! With 14 examples of this amazing phenomenon, this lesson is a PER-fect way to per-FECT your English! After watching, you can download and print the resource page which contains 30 more examples for you to practice.",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "Change word meanings with SYLLABLE STRESS",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/vmU1OzFdems?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Let’s talk business! Today you’ll learn vocabulary that will help you to read and speak about the economy. We will look at common words used to discuss economic matters, such as GDP, stagnation, fiscal, and more. These words and expressions will help you read financial news articles and follow economic reports on television and online. After the lesson, take the quiz and try to practice these words by discussing economic matters in English with your co-workers and friends. Feel free to ask me questions in the comments section on engVid.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Vocabulary: How to talk about the economy",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/EmqR_EI2Dm4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "If you’re interested in British culture, you need to know British measurements. It’s useful to know about the different measurement systems, and interesting to learn how they came to be used. In the UK, we use a combination of imperial and metric measurements. In this lesson I will explain the British measurements we use for height, weight, distance, and temperature. I’ll also teach you some vocabulary connected with measurement. Watch the video, then take the quiz, and see how you measure up!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "British measurements: pints, feet, Celsius, and more!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/l7pitA6Luok?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to tell interesting stories? Telling an engaging story is a social skill that anyone can learn. I’ll give you some phrases you can memorise and use to tell better stories in English. \n\nStories are important to help us understand ourselves and the world around us. One way to view our identities is as a collection of stories. In this video, I break the art of storytelling down into different topics that people tell stories about most often. I’ll share some of my personal stories from my own life to give you examples of how to tell a good story in English. \n\nMost people have a set of stories that they like to tell. For me personally, there are some stories that I have told people hundreds of times! I suggest you practice your most common stories in English because you will definitely use them in a social situations with English speakers. Having your story prepared in English will mean that you can tell it much better, and that your audience will enjoy it more by laughing in the right place, or by feeling the emotion you want them to feel, such as surprise or sadness.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to tell a story like a native English speaker",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/HrcAeGzjBIc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Don’t be afraid of this grammar lesson! I’ll teach you how to use the PRESENT PERFECT TENSE easily, so you can start using it right after this lesson! I’ll give you lots of examples, so you will understand how to talk about things you have done all your life, or things that you have never done before. You’ll learn to use the word never with regular and irregular verbs in present perfect. Check out this lesson and master this very useful English grammar tense!",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "English Grammar: Using PRESENT PERFECT Tense with ‘NEVER’",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/fAAqo3NMrq8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Need to get a high score on your TOEFL test? Confused about the Integrated Writing assignment? I’ll give you my tips and strategies to succeed in this section of the TOEFL iBT. I will first explain the structure of this writing task. You will then learn how to approach the reading and listening sections, how to take notes, and finally, how to write a summary that will get you a high score. Practice this method as much as you can before writing your TOEFL exam and you WILL succeed.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "TOEFL Writing – Task 1",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/2gcfHpGpsOw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know what a silent syllable is? It’s actually one of the topics you have to master in order to sound more like a native English speaker. In this video, you’ll learn what syllables are, which words have silent ones, and how to correctly pronounce some common words with silent syllables. You’ll also learn to count syllables, so you know how many syllables are in a word. Practice these words by taking our quiz at the end of the video, and start speaking English more naturally today.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "Speak English Naturally: Silent Syllables",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/BG017jvhB7I?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you prefer American English or British English? In this lesson, I’ll teach you some of the most common differences between American and British spelling. Learn these differences so that you can write words correctly in the United States and in the United Kingdom. Both styles of spelling are correct. However, it is important to know which style to use, especially if you do business or go to school in an English-speaking country. You can check spelling differences in a dictionary, but this lesson will teach you some of the basic differences in spelling. In New York City you can buy a liter of soda, but in Liverpool you would get a litre. Spell like an American in England and they’ll think you weird. Spell like the English in America and they’ll think you are very old-fashioned. Can you guess what style of spelling I prefer?",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Differences between American & British spelling",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/hcyKWsEL2XM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "All my best advice on what to say at your job interview. I will tell you how to answer the most common job interview questions. I’ll give you the grammatical structures to use when answering questions about your work experience, and also share with you vocabulary and phrases that will impress your interviewer.\n\nI recommend you prepare for your job interview by learning phrases you can repeat in your interview and also by practicing your answers to these common questions. Get a friend to ask you the questions and make sure that you answer them in English! You can follow my advice about how to answer job interview questions whether you are looking for a job in an English-speaking country or you are being interviewed in English for a job in your home country. Good luck with your interview – I wish you success! If you want more help, watch my video on how to write your CV. Remember: there is no ‘try’!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "What to say at your job interview",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/uchyV9lR6vk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn all the English you need to leave natural, effective voice mail messages on the phone. I’ll give you all the grammar, vocabulary, and expressions you need. I’ll also teach you my six-step process for leaving effective messages. If you follow my method, your messages will be clear, polite, and will sound natural. So don’t be nervous anymore — watch, learn, and start speaking more confidently immediately! If you need more help, you can watch my other lesson on English for the phone.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Phone English – Leaving VOICEMAIL",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/7BsBbZqwU-c?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you have a hard time understanding dependent clauses? In English, we have four types of dependent clauses. In this advanced lesson, I’ll help you understand each type of dependent clause and its purpose. I’ll give you definitions and examples of each clause. Mastering these clauses will improve your reading comprehension and make you a better writer. After the class, take the quiz to practice what you’ve learned.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Advanced English Grammar: Dependent Clauses",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/tdGG2uJt5js?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know how to use commas? In this lesson, you’ll learn simple rules for using commas with coordinating conjunctions. Coordinating conjunctions connect two ideas or clauses in a sentence. We’ll look at the most common conjunctions: for, and, nor, but, or, yet, and so. Knowing how to place commas in your sentences will help you to write better, and will make your writing easier to read. This grammar lesson is essential for anyone who wants to improve their English writing. It is especially important for university writing, or if you’re taking IELTS or TOEFL. So join me in this fun lesson, and learn to love the comma!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Writing Skills: When to use commas with FOR, AND, BUT, OR, YET, SO, NOR",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/ArheAe0n3_s?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Today you’re going to master words that even native speakers confuse! You’ll learn common words that you can use in academic and business situations. Whether in conversation or in writing, if you use these words correctly, you’ll sound smart. But if you use the wrong word, you won’t sound so smart. So join me and learn these words, as well as how to use them properly. We’ll look at the following sets of words: affect & effect, principle & principal, compliment & complement, moral & morale & mortal, personal & personnel, censor & sensor & censure.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Confusing Words – affect & effect, compliment & complement, and more!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/-8vLQ2h1HHc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Studying for the IELTS test? Learn the top tips and strategies to get a high score in the IELTS listening section. I’ve helped hundreds of students pass their IELTS exam and I know where students lose marks. I’m going to share my experience and let you know how you can dramatically increase your score on this test. By using these IELTS tricks you will see an immediate improvement on your IELTS practice tests.\n\nYou need to do the IELTS listening test for the Academic IELTS and the General IELTS. I want you to be confident when you go to the IELTS test center to do the exam. So watch this lesson and get some free tips that will help you get the score you need!\n\nWant more videos to help you improve you IELTS score? Check out EngVid’s many other IELTS lessons and for more tips on the IELTS, go to http://www.goodluckielts.com/. Good luck!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "IELTS Listening – How to get a high score",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/tlLsCrME634?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Want to sound more like a native speaker? Learn this American accent secret! In this lesson, you will discover something very common in North American pronunciation: tapping. Tapping is when we change a /t/ sound to a /d/ sound. For example, in North American English we pronounce the word water like wader. Watch this video to find out when we use tapping and what it sounds like. Finally, we will practice the pronunciation of example words together using tapping.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "Sound like a Native English Speaker: Tapping",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/PZzLl18gATo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "A compliment has the same meaning as praise and means to say nice things about people. The opposite of that is to criticize. It is never easy to criticize politely. Find out how to do just that in this useful lesson on compliments and criticism. In this video, you will learn how to give praise in English and also how to tell people what they are doing wrong. You will also learn the meaning of other words like critique and critic. Avoid being rude or awkward, and learn how to achieve constructive results when talking to people about good and bad things!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Speaking English – How to give criticism and compliments",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/FjnX7a64Gz4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are your IELTS Task 1 scores fluctuating in your practice samples? In other words, are they sometimes high and sometimes low? If they are low, it might be because you are using some of the necessary words incorrectly. In this lesson, we will look at nine essential words for this section of the test and how to use them correctly so as to reach your peak band score. Do you know the difference between percent and percentage, former and latter, 20-year-old man and a man who is 20 years old? You will understand all this and more after watching this lesson.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS VOCABULARY – Task 1",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Klnroe1UBRs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn how to use if and whether properly in English. Whether you like it or not, if and whether are not always interchangeable. In fact, if you use the wrong word, it can change the entire meaning of your sentence. In this lesson, we will review the uses of the two words and see how to use them in a way that will reduce confusion and clarify your ideas. How can you be sure whether to use if or whether in the proper context? Watch the lesson, and find out!",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Grammar: How to use IF & WHETHER properly",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/UFuxlnUeGmg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Want to know a simple trick that will help you sound more academic in your speaking? This tip can also help you begin writing the introduction to your TOEFL and IELTS essays. In this video, I will teach you the importance of showing the opposing viewpoint in writing and speech. You will learn how to use words like although, even though, despite, in spite of, and nevertheless. These words help you effectively introduce opposing ideas or facts in speech and writing. Despite it sounding complicated and fancy, it is quite easy to learn! You can practice your new English skills by doing our quiz at the end of the lesson.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "How to express opposing ideas in English: despite, although, nevertheless, in spite of…",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/alInQ7nzKrI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Why do we have a lesson on a writer who died hundreds of years ago? Don’t worry. There’s method to my madness! The poet and playwright William Shakespeare has had a big influence on the English language. Many of he words and expressions that he invented are still in use today, and we often don’t realize it. In this lesson, I will introduce you to some of the most common expressions which first appeared in print hundreds of years ago and are still used today. So come on. Break the ice, and watch the lesson!",
    "subscribeLink": "https://www.youtube.com/channel/UCzBGtBze1AIcDmRwD2ZjiAA?sub_confirmation=1",
    "title": "The Influence of Shakespeare on everyday English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/8XVeMLYiNM0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you sound like a robot when you speak? You can transform your speech from boring to fascinating by using good English rhythm. In this lesson, you will learn many ways to make your speech more captivating for your audience by adjusting your speech rhythm, which includes syllable stress, word stress, and vocabulary choice. You will also learn how you can use poetry to improve the rhythm of your everyday speech and be interesting in any situation!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Go from BORING to INTERESTING with English rhythm",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/eUM1O2pkLJM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Improve your writing by learning the rules of punctuation! Do you wonder why a world-famous actor needs a hyphen while another actor is simply world famous? What is the difference between these two structures, and when exactly should you be using a hyphen? In this lesson, you will learn the basic structure of compound adjectives like ten-year-old girl and green-eyed boy. After watching, you will be able to construct them yourself with ease. It’s really not mind-boggling stuff, after all.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Learn English Punctuation: How to use hyphens with compound adjectives",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/2tZT8vcNljs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this grammar lesson, you will learn more about transitive verbs related to communication. Transitive verbs are verbs that use the preposition to after the verb. For example, talk to, speak to, and reply to are all frequently-used transitive verbs. But how do you know when to use to and when not to use it? Why is it that you can say “I talked to you”, but you can’t say, “I phoned to you”? Watch this video to find out, and stop making this very common mistake.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Grammar: How to use TO with transitive verbs",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/xiRNpeZrFog?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know what it means to wreak havoc, spell disaster, or prompt speculation? In this lesson, you will learn how to use advanced expressions that describe cause and effect. These types of expressions will certainly increase your writing score in the IELTS, TOEFL, TOEIC, or any other English test. Use any of these expressions in your writing, and you are guaranteed to impress your teacher, professor, or examiner!",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Advanced Vocabulary of CAUSE & EFFECT",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/N0ePX99GM70?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Is the IELTS Reading section very challenging for you? Can’t finish all the readings and questions before the time is up? In this lesson, you will learn three approaches to the IELTS Reading section and their pros and cons. The goal of this lesson is to help you finish the test on time without compromising your understanding of the readings. Learn how to read less while answering more questions correctly. After watching, make sure to do the quiz to test your understanding. Good luck on your test!",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS – 3 Reading Strategies",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/B3_pVHJBcKY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What is the structure of the TOEFL independent speaking task? What types of questions are on it? For how long must you speak? I answer these questions and give five tips on how to prepare yourself for the TOEFL iBT independent speaking task. Watch the video to prepare yourself and get a high score.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "TOEFL iBT: Independent Speaking Task – 5 Ways to Succeed",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/mZQgd2sPxpk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What’s academic writing? If you’re in school or university, you must know the difference between general English and academic English. Watch this important lesson to avoid the most common mistakes students make in academic writing. In your own language, the difference between these two modes of writing might not be that great, but in English, there are a lot of differences depending on the context. So even if you know your grammar and write a correct sentence, you might still be wrong because the structure or tone was not appropriate for an academic setting! Watch this video and learn how to write correctly and get higher grades in an academic environment.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "12 Common Errors in Academic English – and how to fix them!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/kudiYRUhSFI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Have you heard how native speakers shorten their words when they speak with each other? This is called reduction, and you may have already started using this in your own English. If so, watch out for some common mistakes when reducing words. The expressions I havta, I wanna, and I'm gonna are examples of reductions. If you have never learned about reduction, now is your chance to understand native speakers better, and to become more fluent in English yourself!",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "How to speak naturally in English: Reduction Mistakes",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/lv8dQNFqcB4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are you SO confused about when to use so or so that? In this grammar lesson, we will look at when and how to use so, so that and so _____ that. After watching the video, test your knowledge by doing the quiz SO THAT you can evaluate how much you understand. You’ll be SO amazed THAT you’ll want to subscribe to my YouTube channel!",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Learn English Grammar: How to use SO & SO THAT",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/T7SWETadMn0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Take your English to the next level by learning eight pronunciation tips that will help you sound like a native speaker. These tips apply to a British English accent or a neutral English accent. In this lesson, you will learn about -ed and -ing word endings, the difference in pronunciation between the north and south of England, the schwa sound, the pronunciation of the R sound in English, the tricky th sound, and more. Whether you want to perfect your pronunciation or learn about different accents, this video is for you. After watching, complete the quiz to test your understanding.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "8 Tips for British English Pronunciation",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/fv3SALKS6qs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you need to communicate in the business world? Face the facts, you need to learn some common business English idioms if you want to head a team. Improve your communication skills in  professional environments by watching this lesson and learning these phrases. When you finish the lesson, take our quiz to make sure you understand the correct usage of each idiom. Then, you can test them out at work by speaking with your colleagues and clients!",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Business English – 6 common idioms",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/lPtgQW3ryyk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Unsure when to use insure? This grammar lesson on prefixes will help you understand some of the prefixes that are common in English. What is the difference between disinterested and uninterested? What about discover and uncover? All are correct but mean different things. Find out now.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Grammar: Negative Prefixes –  “un”, “dis”, “in”, “im”, “non”",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/QV_XlU1oxJg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Did you know that you can use gerunds in active AND passive forms? Did you know you can actually use gerunds in past forms as well as present and future? This grammar lesson is for advanced students, so if you’re having a hard time understanding the constructions, get yourself prepared by checking out my lesson on the uses of gerunds, and my lesson on common verbs followed by gerunds. Once you feel confident, come back here and challenge yourself even more!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Grammar: Active and Passive Gerunds",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/fVlgzuhBi-I?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "To click or not to click? That’s not even a question if you’re an advanced English student who wants to learn even more about infinitives. Check out this grammar lesson if you want to learn how to use infinitives in simple and past forms, as well as active and passive forms. If you find this lesson too challenging or confusing, don’t forget to check out my video on the uses of infinitives, as well as my lesson on common verbs followed by infinitives. Once you’re ready, come back here and increase your knowledge!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Grammar: Active and Passive Infinitives",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/nAlyv5Rd2vo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this lesson, you’ll learn different ways to write easy but effective introductions to your essays. You don’t need to be imaginative with your introduction — all you need to do is follow the structure I give you. For most people, the hardest part of writing an essay is beginning. Stop being nervous and get a high score in your English exam by learning my simple structure for a good introduction. As a bonus, you’ll also learn some useful phrases you can memorise and use in your IELTS and CAE essays.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to Write IELTS Essay Introductions – The Quick & Easy Way!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/1NIcll5RErg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn vocabulary and phrases so that you can talk about politics and understand the news! I’ll teach you new words and expressions to talk about government, elections, and policy. Is the candidate for president in your country promising to cut the crime rate? Is your president proud of the economic boom in your country? Like the video to vote for me, Benjamin!",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Political vocabulary and expressions in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/8wAf4EX3-BI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Using the right words to talk about yourself in a job interview or on your resume/CV will help you to get the job! There’s nothing secret about this. If you learn the right words, you will sound more impressive to the employer than someone who is not using these words. Sound accomplished in your next interview by pulling out the impressive words from today’s video. I’ll teach you how to use words like committed, implement, launch, and many more. Enhance your vocabulary now, and GET THAT JOB!",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Top words for your JOB INTERVIEW & RESUME",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/8ZTikQEt0Z8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Here’s a grammar lesson for advanced students of English. There are many ways to use infinitives in English. Did you know that an infinitive can be used as a subject, object, subject complement, adjective, or adverb? It’s true. In this grammar lesson, I look at these five common ways to use infinitives. Once you’re done with this lesson, don’t forget to check out my lessons on common verbs followed by infinitives, and active and passive infinitives.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "English Grammar – 5 Ways to Use Infinitives",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/a36v-hmALz4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Get a higher score on the IELTS by following these instructions. Do you sometimes think that English tests are not all about English? You’re right. There are many elements being tested on the IELTS and TOEFL, including your stamina and your ability to manage time. This lesson will give you some tips to improve your score, from physical preparations, to section by section breakdowns of how to spend your time on test day.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS – How to manage your time",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/tBtc6rpcMz4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Billy TOLD ME that you wanted to learn this, so I responded with this grammar video! Learn the proper use of reported speech (also called indirect speech), and start using great verbs such as informed, replied and persuaded. Pay attention, because there are some complex grammar rules here! You’ll also learn how to properly use say and tell.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "Grammar: Reported Speech / Indirect Speech",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/gOPRfYARHnU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What’s a security breach, cyber heist, or identity theft? Learn the modern vocabulary of crime with this essential English News lesson. Find out how cyber criminals affected 70 million customers, what problems they caused, and how to protect yourself. Understanding this English vocabulary and these dangers can help keep you safer in today’s world.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Learn English with the News: Cyber Crime",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/VVdmN8L0-xk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What are causative verbs? In this grammar lesson, I will tell you all you need to know about using causative verbs. We use these verbs when there is a power relationship involved in what is happening. For example, when you tell someone to do something, you can use this structure: “I told Tom to wash the dishes.” But did you know it means something different if you say “I had Tom wash the dishes.” or “I made Tom wash the dishes.”? Find out what the causative verbs in English are, and how you can use them in your speech and writing. Using causative verbs correctly shows a real command of the language!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to show authority – Causative Verbs",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Rc8UB66GIi0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Secrets to improve your TOEFL or IELTS Listening score! Are TOEFL’s listening components dragging your time and confidence? Remember: every section has its skills to master. In this class, I will teach you notetaking skills to save time and increase comprehension. This will save you time on the TOEFL or IELTS, and will help you to get a higher score.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "TOEFL & IELTS skills – Notetaking",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/oN1fP2Ffty4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to pronounce words correctly? By the end of this lesson, you will even be able to correct native speakers! I’ll teach you some very commonly mispronounced English vocabulary.\nYou’ll learn some words that English students mispronounce, other words that native speakers pronounce incorrectly, as well as some general pronunciation rules in English, so that you can speak English correctly and confidently. To keep learning English for free, subscribe to my YouTube channel, EnglishByJade!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Speaking English: Advanced Pronunciation",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/CK_PE9ILJjQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "How to succeed in Task 1 of the IELTS Academic writing section. One question that often comes up in Task 1 is “What should I include in the report?” In this lesson, we’ll go over some of the key elements to look for in the infographics you will be given, as well as how to present them in a clear structure. Should you write an introduction? What about a conclusion? Should you put in your personal opinion? If you’re talking the IELTS, you must watch this class!",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS Writing Task 1 – What to write!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/E38hTC6ckdQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "To get a good level in your IELTS Speaking, you need to speak MORE! That means you need to extend your answers. In this quick lesson, I’ll give you an easy way to make simple sentences into more complex, impressive ones by using relative clauses. If you’re not taking the IELTS, you can still use this method to take your spoken English to a higher level.",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "IELTS Speaking: The Secret Method",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/dNBpAWlwmmg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "I’m here to help you sound smarter! In this English lesson, you’ll learn five advanced verbs that will make you sound more intellectual. These verbs are perfect for your academic essays, but you can use them in a conversation at work, or in a discussion with your friends. Check out my other lessons on nouns and adjectives to sound smarter. Take the quiz and test your understanding. Once you know these words, practice your advanced English vocabulary by writing sentences with these words in the comments!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "5 verbs to make you sound smart",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/4dr5lN1jqRE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know how to build a sentence in English? In this lesson, you will learn the basic parts of a simple sentence, or independent clause. Knowing this will make it easier to understand any sentence in written English. Understanding how these different parts of a sentence work together to form meaning will help you write better in English. The knowledge in this lesson is essential for any ‘Independent User’ or ‘Proficient User’ of English.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Grammar: The Sentence",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Cu_mQsWJA_Q?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are you preparing for a Skype job interview? This lesson is packed full of tips to make your interview a successful one! I share my years of experience working on Skype in order to answer all your questions, and eliminate any doubts you may have about your upcoming interview. I cover everything you need to know — from avoiding technical issues to preparing so that you can give your best performance during the interview.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to do a job interview on Skype",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/pAU8z456ufA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Is there a difference between EACH OTHER and ONE ANOTHER? These are both very useful expressions you can use when you are speaking or writing English. In this advanced English grammar lesson, you will learn how to use these expressions, and also learn about the broader topics of reciprocal pronouns and reflexive pronouns. Watch the video now to understand the differences between these expressions, so that you can use them correctly. If you watch engVid lessons with a friend, you can test each other’s understanding. Students studying alone can test themselves with the quiz!",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Learn English Grammar: EACH OTHER & ONE ANOTHER",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/xR4TPLafBJY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "If you’re preparing for the TOEFL or IELTS, vocabulary is incredibly important. In this lesson, I will give you 10 academic adjectives you may need on your test. Learning vocabulary can improve your score in ALL sections, because it is essential to every aspect of English. These words commonly appear on the tests, and are great to use in your academic writing. The adjectives include aware, crucial, prohibited, visible, flexible, and five others. Learn these words with me, and then practice using them on your quiz. Good luck on your test!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "IELTS & TOEFL Academic Vocabulary – Adjectives (AWL)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/_53pP8puw-o?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are you a good friend? Being a good friend means helping your friends when they are feeling down. Speaking English is actually about communicating effectively — knowing the right thing to say at the right time. In today’s lesson, I teach you the best English expressions you can use to console a friend or reassure a member of your family. I also give you my advice on what not to say, so that you don’t make them feel worse! I’m particularly interested in how we use language in social situations. If you are too, check out this lesson and become a better friend!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to make someone feel better",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/9jxeliAUOQY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to sound smarter? In this lesson, I’ll teach you five advanced nouns that you can use in the classroom, at the office, or with friends. Start including these nouns in conversations with your boss, or use them in essays to impress your teachers. You’ll sound smarter in no time! Expand your vocabulary, and make a better impression on the people that you meet. Learn these five nouns with me now!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "5 nouns to make you sound smart",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/G7XElnNJed4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are you a manager? Do you want to be a manager? This English lesson will teach you how to sound like one! When you’re the boss, you need to communicate effectively with your colleagues, clients, and other office workers. In this lesson, I teach you several expressions to use in a professional English-speaking environment, so that you can sound like the boss. Can I 'count on you' to learn this? I know you can 'fit it into' your schedule. If you can 'pull it off', you should 'follow up' by taking the quiz!",
    "subscribeLink": "https://www.youtube.com/channel/UCrBhVZa7t7D5tZ979eBqO9g?sub_confirmation=1",
    "title": "How to talk like the boss",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/43jTh1HiIcI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to learn English? Don't you want to learn English? Negative questions can be very confusing, even for native speakers. In this lesson, I teach you how to ask these questions, and how to answer them. Aren't you glad that I can teach you these things?! Of course you are. That’s why you subscribe to my channel, isn't it?",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "Negative Questions in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/E9OqnbgGqSk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Is your opinion never taken seriously? Do people always question what you say? This lesson is for you! I will teach you how to eliminate the five words that stop you from being an effective speaker. Learn what to say instead, so that you can be just as confident as a native English speaker.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "How to be an effective speaker: BE SPECIFIC!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/nRM3l-Kw9_4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Business isn’t all business! In reality, business and pleasure mix. Are you prepared? Learn the best phrases to make social conversation with your associates. Equally important, find out which topics to avoid! You’ll also learn how to eliminate awkward silences, and how to make your clients or colleagues comfortable when speaking with them. Many business decisions and deals are made outside the office or meeting room. Whether you’re going for dinner with clients, or you’re on a business trip, watch this lesson to learn how to be confident in social situations!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Business English: Mixing Business with Pleasure!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/4K0npnSYjJE?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Should you need help understanding why the subject in this sentence comes after the verb, I can show you. In this English grammar lesson, we will look at sentences in which the subject and verb order is inverted, and the particular situations in which to use them.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Grammar – Inversion: “Had I known…”, “Should you need…”",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/z99Hv6iSzPs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to impress your friends, colleagues, and teachers with more advanced vocabulary? Are you tired of using the same vocabulary again and again? In this lesson, you will improve your vocabulary by learning five advanced adjectives that will make you the intellectual life of the party! This lesson covers maudlin, lackadaisical, interminable, egregious, and visceral. Grab a bottle of wine and get ready to enhance your lexicon!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "5 adjectives to sound smart",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/o0YOITIDdKY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Need to get your hair cut? You can have your friend do it for you. These sentences both use a sentence structure known as the CAUSATIVE. In this grammar lesson we will look at this structure in both the active and passive forms.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Grammar – Causative",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/RiUTWwdhMDg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are you studying for TOEFL or IELTS? In this lesson you will learn academic and technical nouns which commonly appear on the tests. The vocabulary you learn here will be especially helpful in the reading section but will improve your score in the reading, writing, speaking, and listening sections as well. I will teach you nouns such as: aspect, disposal, indication, substitute, trend, and others. Do the quiz, and check out the detailed academic vocabulary list in our resources section.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "IELTS & TOEFL Academic Vocabulary – Nouns (AWL)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/cWes7irLOzI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Are you following the wrong pronunciation advice? Do you think that to have good English pronunciation you need to say every word per-fect-ly? Have you been told that you need to say each syllable in exactly the same way that it is written? Well, in this video I explain why what seems like logical advice is actually COMPLETELY WRONG.\n\nThe secret to getting excellent English pronunciation is to relax your tongue and to start missing syllables! That’s because native speakers do not speak perfectly in natural, everyday speech. In fact, it even sounds strange to say every word perfectly.\n\nI explain to you how we use 'elision' to make our speech more connected, flowing, and relaxed. This means that we don’t say every vowel and sometimes even miss words. I also tell you about the most important sound you need to know about in English to improve your pronunciation – the schwa sound: /ə/.",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "Sound like a native speaker: the BEST pronunciation advice",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/erQJ9ze1KIs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "ARE the English police looking for you? Or IS the English police looking for you? In this English grammar lesson we will look at how to use collective nouns like staff and couple, and of course, police, in the correct way with their matching verbs.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Advanced English Grammar: Collective Nouns",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/1I-vqGntcw8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The key to sounding like a native speaker is the rhythm of your speech. When trying to improve their pronunciation, a lot of people put all their effort and energy into learning how to say the individual sounds of English properly. These people don’t realise that until you understand the rhythm of English, you will just be speaking English with the same rhythm you have in your first language. Your English will be unclear and sometimes hard for native speakers of English to understand. That’s why you must learn as much as you can about the rhythm of English.\n\nWord stress is one of the features that gives English its distinct rhythm. In this lesson, you will learn the grammatical rules of word stress. Importantly, you will see how changing the stress of the word sometimes changes the meaning of the word into something completely different!",
    "subscribeLink": "https://www.youtube.com/channel/UCy-dvmsfmvYXBmt_huqqo1A?sub_confirmation=1",
    "title": "How to sound like a native speaker – Word Stress",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/qv7mop1l7mw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this advanced grammar lesson, you learn three ways to express a negative idea more powerfully in English. You’ll upgrade your speaking and writing skills seriously by learning these bold expressions.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "3 ways to express negative ideas POWERFULLY",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/sFp5LPJ69EI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Have you just been recruited, promoted, or retrenched? I’ll teach you 24 essential business English expressions to talk about your working life and career, from hiring to retiring, and everything in between. You’ll learn key vocabulary for job interviews, resumes, and work performance, as well as the TOEFL, IELTS and TOEIC exams.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Business English – How to talk about your career",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Qu5pvwL9u4Q?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "“Engvid.com is great for English learners where you can learn many new things about the language.” Does that sentence seem okay to you? Well, in this lesson you will find out why it isn’t and where the modifying clause should be. Misplaced modifiers are a common problem in writing and after this lesson, they should be a problem of the past.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Writing – Misplaced Modifiers",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/PhwGtNzdDmc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Gerunds are tough — really tough. They can be hard to master, and new English speakers often wonder why they have to use one in a given situation. In this advanced grammar lesson, I cover the six ways you can use a gerund, including as a subject, object, complement, object of a preposition, and as the object of a possessive. Don’t forget to take the quiz when you’re done!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "English Grammar – 6 Ways to Use Gerunds",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/7Y8cm8k2vzU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The IELTS and TOEFL essay’s success is determined by its introduction. In this writing lesson we will look at how to construct an introduction paragraph that will not only make reading easier for the grader, but will also keep you focused on what you need to say. It really is as simple as 1, 2, 3, 4.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "IELTS & TOEFL Writing Task 2 – The Introduction",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/0FcAub-xqGQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn the “Magic of 3” technique used by English presenters, politicians, and writers. I’ll show you why and how to use this literary technique to get higher marks on your IELTS, TOEFL, or TOEIC exams. You can learn it easily and use it in personal, social, and business situations too, with the same positive results.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Improve your English with the “Magic of 3”",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/QrsFohyz_LU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do we write ten or 10? “I have an eight year old son”, “I have an eight years old son”, “I have an eight-year-old son”, or “I have an 8 year old son”? What is the best way to write this? In this lesson, I will teach you six common mistakes that students make with numbers, and how to avoid them. We will look at pronunciation, grammar, and writing mistakes.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "How to write numbers in English – 6 common mistakes",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/fXVoT7VMCpM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Deliver a successful English presentation with 12 important tips from an experienced presentations coach. An essential lesson when English is not your native language. You will learn what to focus on when you are preparing your presentation, as well as how to come across professionally to your audience.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "How to give a presentation in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/0IFDuhdB2Hk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "The paragraph is the most important unit of a well-written essay. The paragraph has a specific structure and standards that make it effective and enjoyable to read. In this writing lesson we will look at how to construct good paragraphs and improve writing with better flow and clarity.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Writing Skills: The Paragraph",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/TyYHs1-6Vls?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Everything you need to know about the third part of the IELTS Speaking exam. I will tell you what to expect and give you tips and strategies to succeed! There’s no need to be afraid anymore — Emma is here to save you!!!",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "IELTS Speaking Task 3 – How to get a high score",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/XyDrz6YAwvw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "OH NO! YOU HAVE TO TAKE THE IELTS! Well, I can help. Watch this video to learn exactly what to expect in part two of the IELTS Speaking exam. I’ll give you sample questions and answers, as well as tips and strategies for success.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "IELTS Speaking Task 2 – How to succeed",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/vL05g8eW10s?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn how to use therefore and thus to show you have reached a conclusion. These transitions will improve your writing by helping you link ideas. In this lesson, we will look at transitions of conclusion and consequence to help ideas flow and improve our writing styles. I’ll also teach you how you can use words like so, then, hence, and as a result for the same purpose.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Writing – Transitions – THEREFORE, THUS, CONSEQUENTLY",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/75CP1xyoNFo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Native English speakers make mistakes all the time. In this grammar lesson, I look at five common errors to watch for by native and new English speakers. Make sure you’re not learning bad English from a native speaker!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "5 Native English Speaker Mistakes",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/sRFEKvsw-vs?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you need to take the IELTS? I will teach you everything you need to get a higher score in Task 1 of the Speaking section of the exam! A lot of people have to take the IELTS exam when they immigrate or study overseas. Even if your English is good, you could get a low score in the Speaking section if you are not prepared. If you are taking this test, this video will help you. I’ll tell you what to expect and give you a lot of tips and strategies to do well! For more IELTS tips, strategies, secrets, and sample questions and answers, go to Good Luck IELTS.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "IELTS Speaking Task 1 – How to get a high score",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/kPT3IBoFIaA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Remember, recall, and remind are three words in English that are very similar, so a lot of students mix them up. But each one of these words has a specific meaning. Watch and study this vocabulary lesson so that you won’t forget where each one of these words should be used.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Vocabulary – REMEMBER, RECALL, REMIND",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/2_NnkRYCX8s?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Students are often told that unless they practice, they won’t improve. But if you don’t know what unless means or how to use it, you might get the wrong idea. This grammar lesson focuses on the negative conditional and the consequences that follow. I’ll teach you when and how to use unless, if not, as long as, and more.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Grammar – UNLESS & IF NOT – negative conditional",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/waCR-Cdm6tM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to be the life of the party? Do you like clever word jokes? This is the lesson for you! Learn to understand five easy jokes that use double meanings to be funny. You’ll laugh, you’ll cry, you’ll learn.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Learn English with 5 Jokes",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/6nDEvB5eWDU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "This lesson is not like others. You can compare with more, but can you do it with like or as? This lesson will help you compare things and actions correctly and help you write and speak as a native speaker does.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Grammar – comparing with LIKE & AS",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/_cc934JRr6I?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "If you want to learn a useful formal structure, watch this writing lesson and expand your grammatical knowledge. It is expected that you will become a more proficient writer and speaker when you are finished!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Writing – Passive verbs with ‘that’ clauses – “It is thought that…”",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/IsDR3XEv50E?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "One of the most important tools for creating good flow in writing is the transition. Transitions are the bridges that allow a reader to move from one idea to the next without getting lost in the language. In this writing lesson, we’ll look specifically at transitions to join similar, supporting ideas. I’ll teach you how to use in addition, furthermore, moreover, another, and more.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Writing – Transitions – in addition, moreover, furthermore, another",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/2wnlTMrpe8M?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "“A while” or “awhile”? These words sound almost exactly the same, but one is a noun, and one is an adverb. In this lesson for advanced students, I’ll teach you when to use each. Even native speakers get this wrong, so it might take a while, but if you watch the lesson and do the quiz, you will get it.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "A WHILE or AWHILE?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/wJyPhihj1t0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "EngVid users, some of whom are advanced speakers, will find this lesson useful for improving their formal English. If you’re comfortable with adjective clauses, check out this lesson to expand your knowledge.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Advanced English Grammar – Adjective Clauses + Quantifiers",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/GEQhDeNyM8s?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn how to understand almost everything you hear right now in 4 easy steps! If you are an advanced English student, and you already know grammar and can understand what you read, but have trouble understanding when people speak in movies and in real life, watch this lesson to find out HOW to listen and UNDERSTAND!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "4 ways to understand more in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/rs-6FCV3pRY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "There are less native speakers who know this rule than you think. Don’t believe me? If you thought “less” was okay to use in the first sentence, you’re wrong! Find out why by watching the lesson, then test your understanding of the rule by taking the quiz.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Less or Fewer?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/-vefS0B1DIY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "“I wish I were…”. “He wishes it would…”. Wishes are a part of everyday conversation among native English speakers. Are they all dreamers? Maybe. But most of the time, we use ‘wish’ to talk about something that isn’t true or real, more than to talk about our fantasies. In this grammar lesson for advanced students, you’ll learn the correct way to construct sentences using ‘wish’ and the subjunctive voice.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "English Grammar – “I wish…” – Subjunctive",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/W0e3dbx0r7M?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "“I am going to go home.” or “I am going home.”? What is the difference between the future “to be going to” and the present continuous? You MUST use a base verb in one of the tenses! Does this sound confusing? It’s pretty simple, so watch this important grammar lesson to learn the answer.",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "Tenses in English – Future or Present Continuous?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/4LmPecGgqxo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Many times students “presume” that their bad grammar in English is correct because they base it on false “assumptions”. If you never want to be so “presumptuous”, WATCH THIS VOCABULARY LESSON!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Assume or Presume?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/kw1OXWgl5CI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "You want to learn how to understand advanced yes/no questions in English? Check out this lesson to learn how native speakers sometimes shorten their questions. You curious? Come in and learn more.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Yes/No questions for advanced English students",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/769An3SQCXA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "If you want to have fun while learning some advanced English vocabulary, hear a bad English accent, help celebrate my 100th lesson, and are curious about the origin of Mr. E… watch this video NOW!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "James’s 100th Birthday Party!!!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/BAINtj8n7vc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Improve your academic and professional vocabulary instantly! Learn how to discuss the advantages and disadvantages of any subject or topic. Essential vocabulary for success at school, university, and work.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Speaking English – Discussing Advantages & Disadvantages",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/sedMlSPYOWg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Has a teacher ever asked you to make up a class? Did you think he wanted you to decorate the classroom? Or did you understand he wanted you to do the class again? Did you ever have to back up as you were making a backup CD because something went wrong? Confused? This lesson explains some of the changes in sound and meaning when we join phrasal verbs to make nouns.",
    "subscribeLink": "https://www.youtube.com/channel/UC_0NfufarVw04vDfWFm8z_Q?sub_confirmation=1",
    "title": "Phrasal Verbs As Nouns",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/14VcFBmoQmw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "“I don’t like Mary’s cooking” or “I don’t like Mary cooking”? Find out about a very common mistake that even native speakers make with possessives!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Possessive Gerunds",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/hGj0lgfbik8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What are senses? Sight, hearing, taste, touch, and smell. In English, there is a lot of literal vocabulary related to the senses, but you’ll also find that there are many expressions and idioms using the senses. In this lesson, I’ll teach you all of that. You’ll see!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "What are the senses in English?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/z6zNc7I0bi4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Giving advice diplomatically is an art! In this lesson, you’ll learn to use a key expression for making suggestions and recommendations to family, friends, and colleagues. The right way will earn you respect. The wrong way could cost you a relationship — or your job!",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Polite English – How to give advice",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/nqTxzMjyKxY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn why some adjectives in English end in -ING and others in -ED. You will understand when we use each of these endings, as well as the correct grammar and structure for each. I think you’ll find this lesson very interestING.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "-ING or -ED? Adjective endings in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/XbZ7vrJclTo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Lay and lie are two of the most commonly confused words in the English language. Watch this lesson to learn the difference between these words, along with tricks to ensure that you don’t confuse them again. At the end of the video, take the quiz so you can test your understanding.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "Grammar Mistakes – LIE or LAY?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/V_mrH6X8EDI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "There are so many university programs and each program uses different abbreviations (short forms). In this lesson I will teach you some of the major abbreviations you will encounter in the academic world. This will help you if you are applying to or attending a university in North America.",
    "subscribeLink": "https://www.youtube.com/channel/UCdFYD1_0GTCFPxrr5FTgXkg?sub_confirmation=1",
    "title": "University degrees in North America",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/oKp6VhPeHqk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you need to put a comma before and, but, or, for, so, or yet? Learn how to use coordinating conjunctions in English, and when to use commas with them too in this punctuation class. If you’re interested in improving your writing, this lesson is a must!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Writing – When to use commas with AND, BUT, OR, FOR, SO, YET…",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/mQeK0jBkves?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In English, we call words like myself and yourself ‘reflexive pronouns’. Learn how to master these important but confusing words with this grammar lesson. I’ll show you how to avoid the four mistakes students make when using these special pronouns.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "4 Grammar Mistakes: MYSELF, YOURSELF & Other Reflexive Pronouns",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/L4aghWzipA8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Jokes can be difficult to understand in any language — especially if the language is not your native language. In this lesson I’ll teach you about the parts of a joke, and you’ll learn some new vocabulary and expressions that you wouldn’t normally hear in a classroom… and hopefully you laugh!",
    "subscribeLink": "https://www.youtube.com/channel/UCdFYD1_0GTCFPxrr5FTgXkg?sub_confirmation=1",
    "title": "Listening Comprehension – Learn English with dirty jokes",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/9QU5bqql8Kg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this grammar lesson, you’ll learn when and how to use the past perfect. It’s much easier than you think. You may even start using the past perfect as soon as you finish watching the lesson. Try it, and see for yourself.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Past Perfect Tense",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/CjMbA0Z4xzA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "“If I had watched the lesson, I would have known the answer.” OH NO!!! MORE CONDITIONALS!!! Catch up with Ronnie’s lesson on zero and first conditionals, then learn about the ‘Second Conditional’ and ‘Third Conditional’ in English. I’ll teach you when we use them, and what the structures are. After watching the lesson, you’ll be able to answer the question — “What would you do if you had a million dollars?”",
    "subscribeLink": "https://www.youtube.com/channel/UCdFYD1_0GTCFPxrr5FTgXkg?sub_confirmation=1",
    "title": "Conditionals – second & third conditionals (English Grammar)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/SGqGWMoRJC0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you know what a comma splice is? Learn about one of the most common writing mistakes that students make and four easy ways to correct it. This free lesson will help you to become a better writer.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "Writing in English – Comma Splices",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/x1E2wLW9pn8?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Watch this lesson to do well on Task 1 of the academic IELTS. Panicked about the writing section of the IELTS? Or do you work in a field that requires you to present graphs? This English lesson will teach you key vocabulary to use when describing different types of graphs, a requirement in task 1 of the IELTS writing section. I will explain what you must do in Task 1, how you will be marked, and key expressions to use. I’ll also give you some tips to help you achieve a high score on the IELTS.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "IELTS – How to get a high score on Task 1 of the IELTS",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/g44a-UlPc8Y?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "I enjoyed? or I enjoyed myself? In this grammar lesson, I explain when and how to use words like myself, himself, itself, and yourself. We call these words reflexive pronouns.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Introduction to Reflexive Pronouns: Myself, Yourself, etc.",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/buymM_KtSoo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Sports on television can be exciting, but what are they saying? In this listening comprehension lesson we will hear a “play-by-play” commentary on a sporting event and learn about the language that is used.",
    "subscribeLink": "https://www.youtube.com/channel/UCdFYD1_0GTCFPxrr5FTgXkg?sub_confirmation=1",
    "title": "Listening Comprehension – Understand Sports on TV!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/xizJt-JxhlI?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "English pronunciation can be very challenging because the sounds are very inconsistent. Why do we say “beard”, but “heard”? They look like they should sound similar, but they do not. This is a great lesson for advanced students to learn some new words, as well as their pronunciation.",
    "subscribeLink": "https://www.youtube.com/channel/UCdFYD1_0GTCFPxrr5FTgXkg?sub_confirmation=1",
    "title": "Advanced English pronunciation with poetry",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/nArbkK_0CmY?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Can I use the word “retard” when talking about someone with a disability or is this an unacceptable term? What is the difference between “visually impaired” and “blind”? Should I say someone is “handicapped” or “disabled”? This lesson will teach you vocabulary for talking about disability. It will also teach you words that you should avoid. This is not just a vocabulary lesson; you’ll also learn about North American culture.",
    "subscribeLink": "https://www.youtube.com/channel/UCVBErcpqaokOf4fI5j73K_w?sub_confirmation=1",
    "title": "Speaking English – Talking about disability",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/t1RPmY3Xkdc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Native English speakers ask questions SO fast that you can’t understand them! Watch this lesson to improve your listening comprehension in English. You’ll be able to answer questions like watayadoin?!",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "How to understand native speakers’ questions in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/Pt5Dbng7jpQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "“I advise that he study more” or “I advise that he studies more”? Learn this advanced grammar point, and improve your speaking and understanding of this formal structure in English, the subjunctive. Personally, I suggest that you click on this video.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "English Grammar – The Subjunctive",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/WCfV7OkNCDo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Petrol or gas? Lorry or truck? High Street or Main Street? British or American English? Learn both British and American English vocabulary for talking about driving and cars!",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "British & American English: Cars & Driving Vocabulary",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/0uNlcYo36AQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Understand news stories better by taking this listening comprehension lesson. I’ll teach you a lot of new vocabulary and then read you a story. Take the quiz to see if you’ve understood everything!",
    "subscribeLink": "https://www.youtube.com/channel/UCdFYD1_0GTCFPxrr5FTgXkg?sub_confirmation=1",
    "title": "Listening Comprehension – Legal Vocabulary in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/3O3Yb69_t9E?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Don't take a piss. Don't take the piss. What’s the difference? Piss has many meanings in English! Learn some slang expressions you can use in a pub or at a party! In this lesson, I teach the following vocabulary and expressions: take a piss, take the piss, pissed, pissed off.",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "Slang in English – PISS",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/aQLFojIpDwk?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What does it mean when a person is hammered? What is a tab? What’s a dive? In this useful lesson for people who like to party, learn how to speak in a bar or pub setting. Warning: some strong language.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Bar and Pub Slang",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/NLARqYxdjXU?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Would you like to learn why it is polite to use would in English? In this lesson for advanced students, you will see how using the past tense of will in a question shows respect for the person you are speaking to.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Polite English – Why do we use “would”?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/zPzjJHKyNwc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "I love to learn! I love learning! Which sentence is correct? Watch this English grammar lesson on gerunds and infinitives to find out. You’ll learn when and how to use gerunds and infinitives properly—especially useful for talking about your hobbies or interests.",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "English Grammar – Gerund or Infinitive? (‘I like swimming’ or ‘I like to swim’?)",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/7Kt4nz8KT_Y?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Find a new job more easily by learning how to identify and describe your transferable job skills in English. Not sure what transferable job skills are? Watch this video to learn more about this important concept in job hunting.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "How to find a new job – Transferable Job Skills",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/VxfHbBX9eWQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn English vocabulary to talk about people who are prejudiced. I explain the following words: generalization, preference, bias, correlation, prejudice, sexist, racist, fallible, ignorant.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Prejudice Vocabulary – “racist”, “sexist”, “biased”, “ignorant”…",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/nFdXIenda98?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What is a stative verb? Watch this free ESL lesson and learn all about stative or non-active verbs! You will also learn the special grammar rules concerning stative verbs and to be.",
    "subscribeLink": "https://www.youtube.com/channel/UC4cmBAit8i_NJZE8qK8sfpA?sub_confirmation=1",
    "title": "English Grammar – Stative Verbs",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/nHQ8Zt6Hsi4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "English pronunciation can be tough, but immersing yourself in language and having fun with it can make a big difference. By learning to read poetry with tone and rhythm, you can make your spoken English come alive!",
    "subscribeLink": "https://www.youtube.com/channel/UCdFYD1_0GTCFPxrr5FTgXkg?sub_confirmation=1",
    "title": "Learn Pronunciation with Poetry",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/_5FvExL4GNM?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn English vocabulary in this advanced lesson that will help you express the negative characteristics that people have. Is that man at the shop a snob, or is he conceited? Is your sister vain or is she arrogant?",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "English Vocabulary – Negative Characteristics – arrogant, vain, snob…",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/KMIkuRW864U?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn all about the most common adverb suffixes in English in this free advanced grammar lesson. You’ll learn about -ly, -wards, and -wise. I teach what the meaning of each of these endings for words is, and how to use the suffixes properly.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "English Grammar – Adverb Suffixes: -ly, -wards, -wise",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/B0-BlrWQtN4?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "What is an adverb clause? What is a subordinating conjunction? What are the different types of adverb clauses? Find out the answers to these questions in this English lesson, and improve your grammar and your writing. I have written an overview of adverb clauses that you can read and print out at https://www.engvid.com/english-resource/adverb-clauses/",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Improve your writing: Adverb Clauses",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/zlohF_NTnXc?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn when to use “that” and “which,” and listen to a review of the two types of relative clauses. Commas are important and can change the entire meaning of a sentence! Make sure to also watch my lesson on relative clauses.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "That & Which",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/iHe5ixXZQIw?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "This ain’t a joke. If you want to improve your understanding of English slang, check out this lesson and learn about the importance of context. You ain’t going to regret it!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "Slang in English – AIN’T",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/sdL_Y-e-i6E?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to talk about failed plans in the past? This is the lesson for you. Learn how to talk about going back to the future!",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "English Grammar – The future in the past – “Was/Were going to”",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/bYcdBDJNLf0?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "If you’re used to “used to” to talk about past habits, then you are ready to add a new grammatical structure to your English language skills. “Would” has more uses than you think! Also, learn about the differences between “would” and “used to” in the past in this lesson.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "English Grammar – “Would” in the past",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/195RQByeesQ?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Have you ever had a hard time explaining where you are from? Don’t understand directions you are given in English? Take this English vocabulary class and start moving in the right direction.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Speaking English – Talking about Directions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/v2nC0XtJhak?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you have trouble being understood when you ask for information or help in English? Take this lesson and get what you need the first time you ask for it!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "English Grammar – How to ask questions",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/DxnmhmwWb7E?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Learn more about the passive voice, and how to use “have” and “get” when talking about actions that were performed for you or to you, in this advanced grammar lesson.",
    "subscribeLink": "https://www.youtube.com/channel/UClvwNCja3aXxqiFrsKC1DPQ?sub_confirmation=1",
    "title": "English Grammar – Passive Causative",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/DMAEgIky3ck?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this English vocabulary lesson, I use my “pyramid method” to teach you words that are built from the root “tract” — abstract, extract, attract, subtract, detract, contract, and traction.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "English Vocabulary Pyramid – TRACT",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/YyfHLO28ylA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this advanced English grammar lesson, you will learn how and when to use the modal “must”. Test your understanding of the lesson with the free quiz.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Modals in English – “must”",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/3vn5ESmc9As?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Do you want to know how to use ‘all’ and ‘every’ correctly all of the time? Every time? Find out the exact meaning and usage of these words in this advanced English grammar lesson, then take the free quiz to test your understanding.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "English Grammar – ALL & EVERY – What’s the difference?",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/y5lm91xPeuo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Negative adjectives can come across harshly in English. In this Business English class, you will learn a more effective way to complain or disagree.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "Polite Business English – How to Complain and Disagree",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/xE5A_fQB37Q?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "In this new series of English vocabulary “pyramids”, I teach different vocabulary related to one base word. In this lesson, I use the base “muse”.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "English Vocabulary Pyramid – MUSE",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/4wpjb5rvFZA?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "If you want to “keep up” with other English students, you need to master phrasal verbs. In this lesson, I explain how phrasal verbs work, using “keep up” as my main example.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "All about phrasal verbs in English",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/WaQQG-f6gzo?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Improve your ability to understand English by learning about noun suffixes. In this English lesson, I teach you about -ism, -dom, -age, and -tion  — what these suffixes mean, and how they work. This is a lesson for more advanced students. Pull up a chair and learn!",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Noun suffixes in English – understand new words you read!",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/sgMJ16WUEPg?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "Paraphrasing is expressing what you have read or heard in your own words. It’s a skill you need in academic and professional life. This video teaches six effective techniques to show you how to paraphrase successfully and easily.",
    "subscribeLink": "https://www.youtube.com/channel/UCJtBaL1PPmTc1ff0nsihR0g?sub_confirmation=1",
    "title": "English Writing Skills – Paraphrasing",
    "category": ""
  },
  {
    "videoLink": "https://www.youtube.com/embed/loE2_ztqQ64?modestbranding=1&title=&autohide=1&wmode=transparent&rel=0&showinfo=0&theme=light&enablejsapi=1&origin=https://www.engvid.com",
    "description": "This is a high-intermediate or advanced class. We use clauses and phrases regularly in English, and this lesson will help you quickly master them to better understand the language.",
    "subscribeLink": "https://www.youtube.com/channel/UCwA7Aepp7nRUJNa8roQ-6Bw?sub_confirmation=1",
    "title": "Phrases and Clauses in English – What’s the Difference?",
    "category": ""
  }
]